[{"title":"我的第一篇文章","date":"2016-12-13T17:04:48.000Z","path":"2016/12/14/my-new-post/","text":"终于搭建好了一直想做一个博客来着，无奈自己太折腾，对访问速度各种要求，最后就直接用html做博客了。所以使用了hexo，就是现在看到的这个样子。github在国内需要佛跳墙才能访问，于是借助了百度云加速，这样就不用梯子了。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"第一篇","slug":"第一篇","permalink":"//www.zuohuadong/tags/第一篇/"}]},{"title":"69800、XV梦幻之旅为什么是传销？","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/69800xv/","text":"现在传销已经不不再需要限制你人身自由了，有些人可能不理解，为什么现在还有人信传销，那请你继续看下去。 案例一：69800项目 拿69800来说，只要缴纳69800，一周后返还19800，而且声称是为了造千万富翁的计划，能赚到1040万。还有个像模像样的项目策划书，好几页。 他们有这些理由证明： 1.所有钱是通过银行转账，如果不是国家允许，银行不会怀疑这笔钱么？ 实在是很牵强，有很多非法交易，通过银行卡转账就能证明它是真的？先查查对方用了多少张银行卡吧。 2.一星期返回19800作为生活费用，如果不是国家，谁帮你考虑那么多？如果是传销，钱还会给你么？ 这就是这种传销的高明之处，让你相信，然后拉更多人进来。费用打个折扣就是真的了？那还有50000呢。 3.所有收入都要纳税，国家规定纳税的项目都是合法的。 且不说洗钱也是通过交税来洗白的，这个项目有纳税的证据么？发票拿出来看看。 4.这个项目是保密的，目的是让一部分人先富起来。 怎么就选上你了，还能让你亲戚朋友进来，这一部分人也太广泛了吧。 5.这个项目运行很多年了，但是从来没出事情，如果不合法，国家会让这个项目存在那么长时间？ 黄赌毒也存在了很长时间，何况是各种骗术呢。 6.上面会发一张联通电话卡，入网无限扩张，而且号码没有4，暗示项目“没事”，如果不是国家支持，怎么能无限扩充？ 没“4”的号码花钱还是可以买到的，谁能证明那是无限集团网，集团网本身还是可以花钱搞的。 7.做生意的人，每天都电话联系，国家监控电话聊天，如果违法，我们早被活捉。 那电话诈骗怎么没被监控？ 8.所谓活捉，是被当地ZF为了某种原因，请我们扮演被活捉，捉完马上就放了。而且网上负面信息也是国家暗中发的，为了宏观调控，不让更多人加入。 厉害了啊，word哥，这都能编，你咋不说印尼海啸是宏观调控呢？ 9.各种网上的截图改改，甚至不改，直接拿来说什么政府宏观调控了。 天啊哥哥，给你个天气预报图，你是不是都能说成老天爷发怒了。 案例二：WV梦幻之旅 十八线公司&nbsp;在亚洲都没有分支机构&nbsp;根本都是忽悠！ 这个公司在国内根本没有合法经营权，而且入会就是教2400，什么都没有&nbsp;就是可以推荐，在美国入会2400的好处是你可以选择他们的旅游项目&nbsp;会非常便宜，因为除了入会费每个月你都需要缴纳大概300元会费，可是不是所有人每个月都会旅游&nbsp;于是这家公司就是拿其他人的入会费和会费去支付帐单，而且问题也来了，6个会员一共入会费是14400元，奖励200美金以6汇率计算，1200元&nbsp;每月570X6=3420，如果我找的6个朋友&nbsp;他们从来都不推荐&nbsp;我就只要当消费者就好了，每月我也缴300元会费，6X300=1800元，但是你每月却会有3420的收入 3420-1800=1620的缺口。这1620当然是公司来支付&nbsp;但世界上没有平白变出来的财富&nbsp;这1620当然就是他们之前14400的入会费来支付给你&nbsp;所以14400／1620 大约可以支付你9个月，9个月之后都没有新的团队发展&nbsp;可是你依然每月领取3420的报酬&nbsp;。那最后当然就是开始用别人的入会费和会费去支付。这就是拿后加入人的钱去支付先加入的人报酬的模式，这是典型的旁氏骗局方法&nbsp;！ 但是他比旁氏骗局好的地方是，他的确有一套非常非常实惠又棒的旅游福利给消费者选择，他们之所以能以比其他传统旅行社提供价格更优惠和更豪华的旅行项目的原因也正是因为他们除了支付经营者的帐单，也会拿出很大一部分来去支撑会员旅游项目的优惠.通过这样的方式以及大量会员团购的模式与知名的旅游票务网站合作，的确能提供非常棒的旅游套餐。 但是他们正因为通过这样的方法刺激大众，让他们不断分享这个又可以优惠旅游又可以赚钱的好项目，不断的拉拢后来进入的会员的费用来填补前面的缺，也就是说如果这家公司即便发展到了年营业额100亿美元的规模，只要公司开始变得只有消费者而没有经营者产生，那么只要9个月时间&nbsp;就会出现大面积的崩盘和坏帐。 因为很多之前加入的经营者在不断领取已经在该公司不存在的利润，哪一家正常的公司拥有大量的消费者每月不断循环缴纳月费的还会倒闭的？当然我们完全可以假设不断的会有经营者加入，但这家公司这种双轨制的模式本身就是极度不健康的.有非常大的隐患。 像这种WV好像一夜之间就火了，但经验告诉我，物极必反，来也匆匆去也匆匆[抠鼻]根本没有人会天天旅游，全部是冲着拉人头去的。别让自己一时糊涂钱没赚多少直接进监狱！ 也是什么创始人参加慈善基金会了，跟哪个大明星，政府官员握手了，什么携程出了一份问卷调查，结果大家都选MV梦幻之旅啦。 骗子捐款就是好人了？&nbsp;粉丝跟明星握手就是好人了？&nbsp;携程出的问卷你有没有仔细看，总共才500多人答卷，况且根本就不是携程官方出的问卷，你好好对比下。 都是什么神逻辑，要是有新闻报道，XX地球人拾金不昧，那全地球人都是好人了？ 美国总统喜欢旅游，是不是就可以拿来证明NV梦幻之旅是真的？&nbsp;求你们骗人用点心好么。 最后还是说：请多查查知乎。 之前文章由于lofter限制，未能发出，谢谢支持。","tags":[{"name":"XV梦幻之旅","slug":"XV梦幻之旅","permalink":"//www.zuohuadong/tags/XV梦幻之旅/"},{"name":"69800","slug":"69800","permalink":"//www.zuohuadong/tags/69800/"},{"name":"传销","slug":"传销","permalink":"//www.zuohuadong/tags/传销/"},{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"}]},{"title":"关于生成唯一加密二维码的方案","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/ercode/","text":"作为一个产品君，其实写这种东西心里是没底的。 事情起因是这样，因为项目需求，技术那边需要写一套算法，生成唯一的二维码，用户扫描二维码获得积分，而且只能使用一次。 ——————–如果你想知道最终结果，请直接拉到文章末尾—————- 然后技术用了php7的随机算法，加上哈希和时间戳的，但是有一个很重要的问题是：如果在1ms内生成多个，由于随机算法的原因，有可能出现重复。 最近刚好在看rsa算法，于是想到了通过rsa算法来加密，当然，为了生成的二维码具有可辨识度，使用了不怎么安全的512位算法。 而且为了不跟url冲突，需要对加密后的字符串进行urlcode编码，这样大概的长度是95位。 所以这个方案一的执行结果是： 第一步：生成唯一ID并制定好规则 商品ID（4位）+8位纯数字（唯一）&nbsp;【生成的时候使用sqlite3 数据库进行自增，以保证生成的字符串唯一】 第二步：使用公钥加密并且转化成urlcode编码 第三步：生成网址二维码。 http://aaa.com/code/这里是urlcode编码 第四步：服务端使用私钥解密，并且验证是否符合第一步的规则。 并且在数据库里做记录，防止重复验证。 （这里可以设定失效日期，减少数据库的占用和改善查询性能。定期做清理。数据库使用postgresql，查询性能会比mysql好一些） 方案的好处当然是拥有一对密钥，即使丢失一个，影响也不是很大。 问题也存在：第一就是RSA加密解密性能问题，第二就是数据库查询问题。 这两个基本上决定了性能不可能快。 于是想到了直接用hash值加密，全部存在数据库中，但是这样的话需要一行行比对，而且在字符串比较长的情况下，很耗费时间。能不能有一个明文的ID进行索引呢？ 后来突然想到网站的用户名密码方案。 这里先说一下网站用户名密码的加密方案。 密码先通过JS的hash加密，传送给服务端，服务端再进行一次加密，然后比对数据库里面的已加密值，由于整个过程中是密文传输（数据库里也只存储密文），且hash是不可逆的。所以是很安全的算法。 那么现在将用户名看作是唯一ID，密码hash的值看作是密钥，由于hash是不可逆的，所以不存在解密的可能性。 那现在的方案是： 第一步：确定唯一的二维码ID（明文） 商品ID（4位）+8位纯数字（唯一）&nbsp;【生成的时候使用sqlite3 数据库进行自增，以保证生成的字符串唯一】 第二步：随机生成一个哈希值（当然这个要存在数据库里了） 第三步：生成二维码 http://aaa.com/code/123412345678/这里是哈希值&amp;nbsp; 1234是商品ID，12345678是唯一ID。 第四步：验证，以ID为索引，查找对应的值是否正确。 当然注意，验证过的可以删掉或者标记为已使用。 上述商品ID和8位数字要占用掉12位，而且看起来也不是很安全，那么我们可以通过这个工具，进行加密的同时，缩短它的位数：http://hashids.org/php/ 1234,12345678&nbsp;可以缩成：ekNs4zWJM&nbsp;&nbsp;（9位加密字符串） 当然，其实也可以不用到hash，直接用PHP随机算法生成。 具体可以查看：http://www.zuohuadong.cn/2016/11/22/php_rand/","tags":[{"name":"二维码","slug":"二维码","permalink":"//www.zuohuadong/tags/二维码/"},{"name":"PHP","slug":"PHP","permalink":"//www.zuohuadong/tags/PHP/"},{"name":"加密","slug":"加密","permalink":"//www.zuohuadong/tags/加密/"},{"name":"技术","slug":"技术","permalink":"//www.zuohuadong/tags/技术/"}]},{"title":"PHP生成更好的随机数","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/php_rand/","text":"PHP不论是mt_rand 还是rand函数，都太差了，下面我用一张图证明： 一个比较简单的方法，用随机数填充一个位图，下面是一个填充黑白图像的例子。这个是用C#的System.Random类生成的随机数填充的位图。这个是用php的rand函数生成的随机数填充的位图那么，一目了然。 PHP7下可以直接使用 random函数， 但是PHP5以上没有random函数怎么办呢？ 看看这个吧： https://github.com/paragonie/random_compat/","tags":[{"name":"PHP","slug":"PHP","permalink":"//www.zuohuadong/tags/PHP/"},{"name":"web","slug":"web","permalink":"//www.zuohuadong/tags/web/"},{"name":"随机算法","slug":"随机算法","permalink":"//www.zuohuadong/tags/随机算法/"},{"name":"随机数","slug":"随机数","permalink":"//www.zuohuadong/tags/随机数/"}]},{"title":"XX币/“刷单”/“众筹”Mcclub 为什么是资金盘的骗局？","date":"2016-10-14T15:05:43.000Z","path":"2016/10/14/mfcculb/","text":"还是老样子，请明确两点： 1.不是赚钱的事情就代表它是对的，因为骗人，抢劫，贩毒一样是可以赚钱的。 2.请不要用“如果它是违法的，为什么没被抓”等此类语句，我们今天社会上的违法行为依旧存在，随着网络技术的发展，这种违法行为的发现，取证，彻查也变得越来越难，只能说存在漏网之鱼。 ———–如果您不能理解以上话，那就不用继续看下去了———– 首先从虚拟货币说起，比特币、约克币、瑞波币、莱特币&nbsp;目前占了全球94%以上的虚拟货币市场，如果你玩的不是这四种，那么基本可以直接放弃了。 —————–为了保证大家能听懂，我尽量用自己语言组织，所以不太标准——— 这类虚假货币跟类比特币类最大的不同，是它不需要挖矿，甚至也没有自己币种的名称，直接以人民币标示。 这类的大致归为资金盘，特点是这样： 举个例子： 例一： A虚拟账户里有100币，手里现金是0， B账户里0币，现金100元。 A选择提现100，这时候B把100元现金转给A，得到奖励105币。 此时A 0币，100元现金。 B 105币，0元现金。 但是B可以重复A的过程，继续提现，从而把风险转嫁给C。 可以看出，整个过程都是毫不产生价值的，但是感觉钱在增多。&nbsp;这个时候如果没有C来接B的盘，那么这币就完全砸在B手里了。因为总有一天，提现的人会远远多于接盘的人。 例二： A有100币，可以提现，但是收10%手续费，B想入局，但是只能买币，所以A把币转给B，B把现金给A。然后就是发展下线有提成，各种花样都有。 其实现在一般骗局都至少混合了庞氏骗局，资金池，传销其中的一种或者两种。 拿Mfcclub来说，声称什么来自马来西亚，号称多么牛逼的公司，确在国内连个办事处都没有，连个什么政府审批文件都办不下来。 在马来西亚的目的很简单，这种玩意如果服务器敢放国内，分分钟就被查了。 然后拿一些毫不相关的新闻来给自己贴金，丹麦无现金化跟你毛线关系，数字货币跟你毛线关系，你咋不说印尼海啸跟你有关呢，你说老天爷发怒了，要惩罚这些不用mfcclub的人呢？ 请相信钱不会凭空产生，也不要引诱更多无辜的人参与到这场游戏，因为很有可能他们就是最后接盘的人。如果真的存在这种游戏，那我们12亿人早就靠这种游戏国富民强了。 一如既往地：没事多看看知乎。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"DK币","slug":"DK币","permalink":"//www.zuohuadong/tags/DK币/"},{"name":"刷单","slug":"刷单","permalink":"//www.zuohuadong/tags/刷单/"},{"name":"众筹","slug":"众筹","permalink":"//www.zuohuadong/tags/众筹/"},{"name":"资金盘","slug":"资金盘","permalink":"//www.zuohuadong/tags/资金盘/"},{"name":"经济","slug":"经济","permalink":"//www.zuohuadong/tags/经济/"}]},{"title":"XX虚拟币,Mfcclub为什么是庞氏骗局的说明","date":"2016-10-13T15:52:43.000Z","path":"2016/10/13/dkb/","text":"说这个事情之前，请明确两点： 1.不是赚钱的事情就代表它是对的，因为骗人，抢劫，贩毒一样是可以赚钱的。 2.请不要用“如果它是违法的，为什么没被抓”等此类语句，我们今天社会上的违法行为依旧存在，随着网络技术的发展，这种违法行为的发现，取证，彻查也变得越来越难，只能说存在漏网之鱼。 ———–如果您不能理解以上话，那就不用继续看下去了———– 首先从虚拟货币说起，比特币、约克币、瑞波币、莱特币&nbsp;目前占了全球94%以上的虚拟货币市场，如果你玩的不是这四种，那么基本可以直接放弃了。 本着公平，中立的原则，我将介绍它和货币，常见的虚拟货币区别，以及为什么是骗局。如果您对货币没兴趣，请直接拉到最底部。 —————–为了保证大家能听懂，我尽量用自己语言组织，所以不太标准———– 货币为什么有价值？ 为了搞清虚拟货币为什么会有价格（这里说的不是价值），咱们从货币说起，货币最初只是为了改变大家以物易物的方式，通过一个大家都认可的东西做为货币，由于全球黄金总量是基本恒定的，而开采黄金需要成本，这是真实的工人去淘金，所以会有人工成本，而大家本身对黄金的需求，抬高了黄金的价格，但是一般不会低于人工成本，所以国际货币组织规定是以黄金衡量。 纸币为什么有价值？ 由于黄金/白银&nbsp;都不方便携带，作为国家又有一些其他需求，所以强制规定了本国的纸币作为货币，最早纸币是跟黄金挂钩的，后来取消了，所以目前货币大多是由政府公信力担保，当然如果政府大量发行货币，会导致货币贬值，造成国内经济混乱，大家以后会用其他的货币交易，所以也是得不偿失。 虚拟货币的价格哪里来？ 第一种是Q币这样的，以公司公信力为保障的，这里先不做细谈。 第二种是比特币这样，比特币是一个设计相当巧妙的虚拟货币，主要是以下三点： 1.因为它总量恒定（这点很像黄金）， 2.不受任何个人或者组织的控制（不存在无限增发货币，或者是突然跑路） 3.完全匿名（适合做一些非法交易） 4.开采需要耗费显卡资源，这些实际的成本就是电费。 所以总结起来就是，因为它不受人为控制，而且开采需要消费真实的电费，并且由于匿名，使用范围广泛，所以大家对它存在一个心理预期。 举个不恰当的例子，冥币，在现实世界可能一文不值，但是如果存在另一个世界，可能真的就是他们那里的货币了。所以虚拟货币根源在于人们的心理预期，当人们没有这个心理预期，它就会一文不值，所以是因为有人玩，你才卖得出去，交易得出去。 开头所说的以上四种货币，均符合比特币的这些特点，所以虽然存在风险，但是也是可以玩玩的，但如果不是特殊原因，也并不建议。 第三种是类似U币，DK币这样的完全骗局类型的。 U币，DK币为什么是骗局？ 宣传方式： 任何正规的虚拟币，都没有以赚钱为目的的宣传，都只是方便大家交易使用，或者以对抗政府增发货币为目的。 是否具有价值： 资产是不可能凭空产生的，要么耗费了一定真实的资源（比如电力），要么就是你凭借着大家的心理预期转手赚到的，而对于股市来说，公司可以不断产生价值，要是公司不产生价值，那股票一定会跌。 以DK币来说，租用所谓的云矿机，你真的亲眼见过这个实体的机器？它在消耗什么？ github开源代码： 自己去下载DK币的源代码，能在自己电脑上跑么？不能。&nbsp;只能在掌控人的服务器上跑，真正服务器上有没有这个代码，谁又去验证，反正钱就是一个数字而已。 说白了，自己随便从比特币复制点代码，就算可以运行，放在github上开源骗骗人，至于真正服务器上跑的是什么，你根本看不到。 腾讯、百度、谷歌都有开源的东西，倒是复制一个腾讯出来啊？ 区块链技术： 这个不做展开描述，举个例子，比特币的挖矿用户，是需要安装比特币软件来进行挖矿的，要想破解比特币，你必须掌握这些一半以上的电脑，而这个数量是以百万计的，所以几乎是不可能的任务。而DK币，所有矿机在“云端”，那即使它是真的，控制云端的人也可以轻易篡改数据。 央视报道： 全是断章取义，这也是央视报道：《虚拟货币：只进不出的骗局》http://news.cntv.cn/2015/11/28/VIDE1448667363846704.shtml &nbsp; 随便从央视截个图就能攀上亲戚的，也是醉了。 所以这些骗子币的最主要问题是，可以被完全操控，想让你有多少钱，就有多少钱。 你肯定还有疑问 为什么有人会赚钱？ 因为只要钱不提出来，永远是数字，让前面的人赚了钱，可以骗更多后面的人，典型旁氏骗局。只要有不断会员加入，就不会亏空。所以各种币都会有限制：3个月以后可以提现，新入会员必须买老会员的币，提现需要高额手续费。目的就是鼓动发展会员，维持不崩盘。 说白了这种东西，网上买个程序，谁都可以做。 为什么都宣称是来自国外？ 也很简单，这种违法的东西，在国内根本做不了备案。 怎么证明这点 不论保险也好，基金也好，对于一些可以盈利的东西，比如股市、贷款、高息存款等，基金经理都会去尽量选择低风险高回报，如果DK币这么牛逼，你一年都可以翻几番了，那这些基金经理为什么不入？&nbsp;你所看到的余额宝，还是3%的年回报率。 你是觉得那些基金经理一年上百万年薪，是个傻逼么？ 另外，被我们回绝，但是想找我们开发此类软件的不在少数，需求里还有写明后台要留作弊接口的，具体怎么个运作流程，你真玩的过那些人么？ 最后奉劝大家一句，没事多看看知乎。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"DK币","slug":"DK币","permalink":"//www.zuohuadong/tags/DK币/"},{"name":"虚拟货币","slug":"虚拟货币","permalink":"//www.zuohuadong/tags/虚拟货币/"},{"name":"旁氏骗局","slug":"旁氏骗局","permalink":"//www.zuohuadong/tags/旁氏骗局/"}]},{"title":"QQ/微信为什么没支付宝安全？","date":"2016-09-11T08:27:28.000Z","path":"2016/09/11/wechat-qq-alipay-safe/","text":"使用频率 这点不用说，也明白，一般来说微信/QQ 这种社交产品的登录/使用频率会远远高于支付宝这类应用，古语有云“言多必失”，使用次数和频率的增多，也造成了更容易被盗的现象。 使用场景 一般来说，在网吧等一些明显不靠谱的网站一般人绝对不会或者不敢使用支付宝，但QQ造成心理感受到的损失相对来说要小很多。 登录方式 最早来说，QQ只要通过账号密码就能登录，手机短信也贵，而且电脑普及度也并不是那么高，所以绑定设备这个方法不可行，那会智能机还没出呢，另外，那时候电脑各种流行病毒木马，甚至假QQ都有，一不小心就输入密码进去。而支付宝当时只有网页版，需要安装数字证书等等（毕竟常用来支付的电脑就那几个），但是这种方法显然不能用在QQ上，你去网吧也安装个证书？完事还得小心翼翼卸载掉，显然不能这么干。 现在来说，智能机普及了，验证方式也多种多样，尤其是可以感觉到微信的安全（毕竟是绑定手机）要比QQ安全好出很多。 产品属性 两者产品属性而言，QQ/微信毕竟是要在安全和方便使用之间做个权衡，这就肯定不可能弄个U盾放银行保险柜，需要的时候再取出来登录，技术上肯定不是问题，但使用方便上，就太神经病了。也总不至于发个聊天消息，验证手机短信、输入聊天密码吧。 支付宝也有学习微信方面的，比如微信支付一开始的六位数字支付密码，后来支付宝也这么干了，所以都是从安全和便捷中做个权衡。 而支付宝就可以通过短信验证，各种方法去限制，来保证用户财产安全。 安全方向 QQ/微信&nbsp;更倾向于诈骗的提醒，这是产品不同所导致的方向不同。 支付宝则倾向于账户安全，还弄了保险，就算被盗了，它还可以赔钱给你啊，让你觉得支付宝还是很靠谱。 用户心理 另外来说，还有一点更根本的原因，QQ只要登录上去，就认定是被盗了，支付宝，登录上去，你还得把钱转出来，用户才觉得被盗了。况且还有很多用户的支付宝里面根本不放钱，所以这对比来说，也是不公平的。 使用人群这也是特别重要的一点，比如，现在年轻人好多父母，一定会使用微信，但不一定使用支付宝。使用支付宝的用户一般来说，也比使用微信的用户更懂互联网。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"qq","slug":"qq","permalink":"//www.zuohuadong/tags/qq/"},{"name":"wechat","slug":"wechat","permalink":"//www.zuohuadong/tags/wechat/"},{"name":"alipay","slug":"alipay","permalink":"//www.zuohuadong/tags/alipay/"},{"name":"支付宝","slug":"支付宝","permalink":"//www.zuohuadong/tags/支付宝/"},{"name":"微信","slug":"微信","permalink":"//www.zuohuadong/tags/微信/"},{"name":"安全","slug":"安全","permalink":"//www.zuohuadong/tags/安全/"}]},{"title":"为什么微信一直没有电脑客户端","date":"2016-09-11T08:27:28.000Z","path":"2016/09/11/wechat-pc/","text":"首先说明，这里的客户端是真正意义上拥有几乎微信全功能，而且可以离开手机APP，独立使用的客户端。 没必要与QQ交火 不得不说微信一旦推出这样的客户端，那么就必然出现，在PC端增加用户体验，功能要无限与QQ接近，这样无意会增加产品开发难度，同时这些功能要不要加进手机版里？那又会无限臃肿。而且已经有QQ了，为什么还要再有一个QQ？ 安全性问题 如果推出电脑版，不再需要微信扫一扫，那安全性就得重新考虑，这一来又得增加各种功能。而这样的带来的额外价值并没有多少。1 产品定位 微信真正专注于的，在于移动端，客户群体来说，也没必要用微信既实现日常交流，又实现办公相关的功能，这样更容易使得很多人办公和生活无法分离。会造成新的问题和麻烦。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"微信","slug":"微信","permalink":"//www.zuohuadong/tags/微信/"},{"name":"微信电脑端","slug":"微信电脑端","permalink":"//www.zuohuadong/tags/微信电脑端/"}]},{"title":"再谈解放号与威客","date":"2016-07-27T10:13:57.000Z","path":"2016/07/27/jiefanghaoweike2/","text":"发现自己很久没有更新博客了，最近一直比较忙，但也确实有不少想说的话。 基本上眼睁睁地看着天篷网做废了，解放号一直定错位，好多好的东西一直没执行下去，这也算是解放号的一个悲剧吧。 解放号的问题 问题一：产品定位不明确 那先说说解放号的问题吧，解放号定位一直是大型项目开发，最近动静不可谓不大，开发协作功能之全，代码托管和质量管理等等流程之专业，真的差不多够把一个大型项目“完整”托管到解放号了，这里的“完整”其实也意味着包括了整个项目管理。 但是，然并卵，既然是大型开发，不可能没有自己完整的一套体系，如果解放号功能不够完整，那我为什么要用它，话说回来，如果解放号功能够完整，我是不是还是要考虑我的迁移成本，我的协作成本，那我还是不会用这玩意。另外，既然这么大型的项目，我不太可能不进行线下交易，不太可能把代码托管到解放号，因为不论甲方乙方都会担心代码泄露。那对于中小团队及个人开发者来说，用这玩意好麻烦啊，操作好繁琐啊。 那，我只能说本来分析问题的思路是对的，解决双方信任问题，用专业的工具管理，后期好评估责任，这也确实是痛点，但是解决问题的方式完全不对。对于中小团队，应该考虑的是简化流程，方便双方使用，把流程简单和规范化，然后引导双方使用，这样才能有利于双方，而不是把东西全部照搬，然并卵的。对于大型项目的开发，解决的问题应该是同步乙方和甲方的数据到平台上，比如定期把项目进度贴上来，作为阶段性证明，把项目规划贴上来，告诉甲方什么时候该验收什么，差不多是什么标准。而不是去改变用户习惯。 问题二：想法不错，执行太差 举个例子，解放号有个在线合同，是坑了我很多次，不论哪方违约，都没有强制执行的可能，也没有从下次项目中扣款的可能，更没有提示风险或者直接拉黑的。那这个在线合同更多只是名义上的。如果是小项目或者项目特别紧急的，也很难去完全走一份线下合同。所以一份交易保障，或者是发包方接包方的评星，可能远比这个更有用。 问题三：优质开发者资源并没有被良好利用 一直觉得解放号有着优质的开发者资源，可是在网站上并没有突出体现出来，并不能直观地看到哪个开发者就一定比哪个好。只能是通过官方客服来对接资源。这种一方面开发者很难有良性竞争，另外一方面&nbsp;导致解放号只能投入更多人力来解决这个问题。 问题四：工具没解决用户痛点 就举个项目代码质量评估，且不说然并卵的问题，用户实际操作上也并不会用，你弄个discuz&nbsp; phpwind&nbsp; ecshop dedecms …的判断都比那好很多。最近有了解到一个云沃克的威客平台，在用户痛点上把握得也非常到位。收取项目10%费用，帮助做项目前期需求分析，评估开发工期，平台上的单子利润不是特别大，但也没有特别坑的，一些技术主导型的团队就十分适合，完全不用担心跟客户沟通问题。有时候一个大的项目10W，被分成小项目可能就3-5W，同时他们也解决了项目的风险，还聚集了一堆有能力的开发者，这才是良性循环。 但是，解放号上，我根本难以看到这种用户痛点。 解放号应该怎么做 第一：&nbsp;做好定位，简化非必要流程，增加必要流程 如果大型企业并不怎么需要这些的话，那针对中小团队和那些在大型企业兼职的开发者重新思考解放号的立场。 这些人其实多多少少是有使用工具的习惯的，尤其是那些在大型企业工作的人。但对于这些小项目如何让它方便简单地使用。 发包，推荐用户说明哪些是必要内容，在用户不懂的情况下，可以找客服沟通，也可以使用推荐的模板。 审核，拒绝一些明显离谱的需求，这类需求是很容易伤害开发者的。 需求，比如需求界定，最后通过文档还是什么，推荐开发者使用什么样的工具什么样的形式来确定，有什么样的推荐。当然，如果是审核相当优质的资源，可以做重点推荐，以及官方做需求分析。 然后开发过程中，整合一些比较好的开源项目推荐给开发者，这样能节省时间，也能降低开发成本。 然后评审，比如使用了dedecms 开发，原则上没有版权，但国内都这样用，代码质量只能说一般，比如使用了ThinkPHP5.0框架，代码简洁，告诉用户经过评审代码质量很好。同时也能确定出开发者的能力。 验收，交付等等，以及如果违约，该怎么处理，关闭接包方账号还是提示有风险等等，或者从下一次项目中扣款补偿。 像什么会议沟通什么的，QQ在线沟通可能更方便，还能传文件，上次遇到跟客服聊天，传图片的时候都出问题了。留痕确实要有，比如通过需求文档，通过git代码托管（如果不熟悉，可以直接上传代码包），但是交流的习惯很难改变。 中期验收确定，以及文档交付，包括管理账号、说明文档、服务器账号密码等等。主要是得流程化，一步步告诉双方怎么走。 第二：&nbsp;做好开发者资源 解放号内部CRM的接包方信息很全，不如把一部分资源放出来，建立开发者完整档案，做国内优质的接包方平台，吸引国内的发包方甚至是其他平台的二包。 建立完整的诚信和案例档案，每个案例都严格过审。 第三：建立高质量外包开发 其中包括对接国外的一些开发资源，尤其是印度，当然也要解决沟通问题。 发包方输入需求时，提示可以使用XX进行二次开发，节约成本，用户能浏览大致功能。 接包方也能看到一些程序和插件的提示，建议使用，增加开发速度。 同时所有开发会和网上一些现成的进行代码比对，确保质量。 第四：建立开发者社区共享代码成果 官方最好主导一些开发，比如CMS主要推荐 doccms 次要推荐dedecms，论坛主要推荐：Discuz。&nbsp;然后大家有开发功能或者插件、模板、甚至是解决某个问题&nbsp;的可以放在官方商店，其他开发者使用需要付费或者免费。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"解放号","slug":"解放号","permalink":"//www.zuohuadong/tags/解放号/"},{"name":"威客","slug":"威客","permalink":"//www.zuohuadong/tags/威客/"}]},{"title":"最近关于人人网和产品相关面试的思考","date":"2016-05-25T17:38:29.000Z","path":"2016/05/26/chanpinmianshi/","text":"最近在招产品经理和产品助理，面试题是谈下对人人网发展的思考。也确实发现在西安，产品经理和产品助理实在是供大于求，而真正合适的却很难找，大多只是有自己想法。一些人甚至说出了产品该全面发展的话，普遍用对错作为事实的唯一衡量标准。 如何思考问题？ 有句话叫“小孩才思考对错，大人只权衡利弊”，所以产品一定是放在当时时代，为什么这么做？因为什么样的矛盾最终选择了这么做？甚至在当时情况下，这是不得已而为之的。 产品经理应不应该懂技术？初步的技术你是要懂的，哪怕不深入，你的想法最终要靠技术实现的，那你也是要跟技术去沟通的，如果你不懂技术，说出来天马行空的话，技术是想抽你的。很多产品经理想着：专业的事交给专业的人去做。举个例子，phpwind9.0发布测试版的时候，用户中心对接多个论坛，中间的设置相当麻烦。从技术角度来看，这些东西缺一不可。但如果你是一个懂点技术的产品，就能看出来，有其中一半的步骤是不需要的，这样提升了用户体验，也没降低安全性。我后来跟他们产品经理提，然后他们跟技术确认完之后，是按照我提的方案来的。 产品经理该不该懂运营？产品首先要明确，是以运营为主导（一般就是活动居多），还是以产品为主导（产品特性吸引用户）。作为产品经理，是肯定要考虑到运营的事情，多做沟通，不然真是给运营埋坑。 产品经理需要干什么？除了跟技术交涉，通过运营数据决定产品方向，分析和调查用户真实需求，画出线框图或高保真原型图以外，还要能辨别用户需求里的坑，找出没有完善的逻辑部分，指出更好的产品方案以及初步的规划。如果兼带项目管理者，那还要随时把控项目进度，协调各方资源，随时准备应急措施。 简单说下人人网的发展？个人观点：人人网最初叫做校内网，号称占领了国内实名制社交，&nbsp;但他必然面临的一个问题就是，&nbsp;每年都有毕业生，每年都有新生，这是一个不断投入&nbsp;却没有增长的市场，扩招和计划生育到底哪个占大头呢？从当时PC游戏产业看（当时手游并没有兴起），整个玩家人数在下滑。基本上可以预估到，人人如果保持当前状态，校园市场也会不断萎缩。但是转念一想，走出校园的很多是白领，所以在当时情况下，走出校园，尤其是切白领市场，算是人人比较好的方向。 但是，没有细分白领市场，很多人离开校园后看到人人上还是校园的信息，怀念，但又没办法再融入。所以很多人还是默默离开，当然也有毕业N多年，再通过人人去找老同学的，大多都是问下手机或者微信号，人人并没有那种强社交的属性。走出校园的失利，以及再次看到校园市场的潜力，的确是该重回校园，公共主页确实是个好东西，这其中也促生了很多大V，真是各种转发满天飞，问题也依然存在，就是大量的信息重复充斥着动态，几周前看过的段子，今天又看到了，大量的转发使得看不到校园动态了。同时也没很好的办法去鼓励原创，所以给公共主页降低权重（在动态的第三条折叠显示，类似现在新浪微博的广告），同时也使得大量的大V叛逃人人，转向微信和微博。 进入校园的产品:一是校园广场，直接竞争对手是贴吧，但是校园广场一直体验不好，而且不同于公共主页的创建，校园广场是任命的形式（应该是考虑到同一学校多个人申请的问题），大家觉得公共主页是创建的，是自己的，校园广场是人人的，这么一个感觉，所以很多管理员也不是很尽责。【中间收购糯米和56 以及校园大使事件不在此累述】校园广场最大的问题还在于入口问题，这个我最早有抛出来，最开始校园广场作为一个子菜单出现，后来改成和动态并列在第一屏（需要切换），但却一直没能敢代替动态成为第一入口。因为它叫人人，确实不敢做这样大的尝试，改变产品属性，我觉得这可能是原因吧。 二是社团人，事实证明这本是应该由运营主导的产品，没能很好地切入线下，解决实际问题，也不再累述。同时人人也有&nbsp;哔哔，么么答这两款仿的程序，匿名社交满足好奇心，但违反了人社交基本规律，由生到熟的过程。么么答和所有这类软件一样（比如后来的足迹等等），都无法持续火起来。况且，此时还有外部原因，微信朋友圈（社交）引走了大部分的流量，微博（媒体）也崛起了一批又一批的大V，几乎是腹背受敌，而人人的体验依旧很差（请搜索人人小秘书），广告能够占头条动态的位置就很能说明这一点，各子部门想着快速表现和快速推广新产品，就往往是以牺牲用户体验为代价的，当然人人内部也急需一个新的产品替代。再后来利用学生资源做分期做金融，确实也是无奈之举，以及后来取消实名制，图片美化与贴图的尝试，至此，人人不再是那个人人。 以上仅代表我个人观点，我相信任何人都会有自己不同见解，不代表对与错，对于大公司来说，可能从来不缺想法，但为什么这样做，又是怎么一步步走向成功或者失败，这是一个产品经理该明白的。用自己观点合理说明即可。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"面试","slug":"面试","permalink":"//www.zuohuadong/tags/面试/"},{"name":"人人网","slug":"人人网","permalink":"//www.zuohuadong/tags/人人网/"}]},{"title":"解放号与威客的一些思考","date":"2016-01-16T09:31:07.000Z","path":"2016/01/16/jiefanghaoweike/","text":"传统商品售卖，顾客往往是出于对商品品牌、对售卖人的信任，比如名牌和微商就是这两个极端的代表。而威客是以技术服务为商品的，技术服务这种的具有一定的时间性和不可见性，即双方都不知道在服务期限内会不会出现意外，也不知道对方是按照什么标准来做什么标准来验收的。所以，威客这种服务，信任危机是与生俱来的， 而平台的出现，一定程度上将双方的信任改变为对平台的信任，之前号称国内第一威客平台的某西游网，初期确实带动了一部分威客致富，但随着威客的增多，平台知名度的增强，一些通过平台漏洞来赚钱的人也越来越多，于是需求方坑服务方，自己选自己中标。服务方坑需求方，一堆不相关垃圾作品奉上，选我中标后才给你开始服务。而平台固定收取佣金的方式，导致平台本身也没有动力去制止这种行为。于是，再一次的信任危机爆发。 最近，有一句话逐渐流行起来，叫“专业的人做专业的事”。原本这句话是讲公司内部分工问题，逐渐延伸为外包。请记住，最初这句话说的是公司内部的分工问题，但是一旦延伸到外包，外包团队和你的利益点和需求点都是不一样的，他们是他们公司的利益，所以这句话延伸的前提是这个外包团队可信。于是，大家开始把非核心业务外包，我们之前接触到的一个客户连续被三个外包团队骗了，最后给他交付的东西，是一套现成的源码，根本不是客户的需求。所以很多客户要求本地，需要实地考察，一定程度上也反应了外包产业的混乱。所以逐渐出现两个极端，小的外包团队价格越拼越低，大的外包团队价格越拼越高，反而是有质量的产品难以出现，整个外包产业都很浮躁，简单，快速解决问题，就跟游戏打怪升级一样升到100级再说，装备跟不上也不管了。 这里有必要说下收取交易佣金的问题，既然威客的服务也是属于一种商品的性质，那么，就有理由参考淘宝、天猫、京东这些网站，不论是国外的ebay还是国内的电商网站，交易佣金是不直接收取的，威客这种高服务性质的，如果存在佣金，很多人通过平台交易一次后，就逐渐专为线下交易，或者转为其他不收取服务费平台的交易，服务是有一定时间的，双方通过这段时间相互熟悉，理解，信任，还是很有可能的，对于平台的感情不一定大于人情，这是很难解决的。而免费的则通过店铺VIP、引流方式收取服务商的费用，但是这种，你也很难保证威客的质量，换句话来说，威客这种平台天生存在两种人，一种低价解决需求就行的人，对应的手头有一堆代码，破解的，没授权的，之前做的，能分分钟解决问题，但可能漏洞百出，但是需求方就是需要这种的，我淘宝买套代码才500，你改改东西就要收我5000，这是低端需求方没办法接受的。另外一种姑且称为高端需求方，他们意思也很明确，我给你这么多钱，你好歹给我做好点吧，但是用旧程序做的，用侵权程序做的，也比比皆是，作为需求方也很难辨别，往往当了个冤大头。有些有点条件的需求方，朋友懂点技术，就开始胡乱要求，比如你为什么不拿C++这种高效率的程序做网站呢，你跟他对喷没有好处，需求方请的人肯定是他信任的人，你按照他的方式做也是坑爹，只能慢慢理论。所以从趋势来看，整体应该是会逐渐偏向于免佣金的形式，但是会收取服务方的服务费，当然，你平台流量肯定是得有的，不然真没人掏服务费，而且怎么避免那些没有能力，但有钱的团队不会破坏这一平衡呢，这需要一个长期沉淀结果，而且团队这种的也是会变的，万一哪一天核心人员都走了，可真就从高质量团队变成低质量的团队了，这种不可控因素也太多。这种不如直接从人身上做把控，一些团队由哪些高质量的人组成，当然面临的问题就是有些接私活的怎么办，隐私怎么保证的问题。从整个中低的外包市场来看，往往做的质量比较高的是一些大企业，尤其是是BAT这样企业的员工，做的东西质量和逻辑上都比较不错，相对来说价格也算合理，但是有时间问题，比如近期公司突然上线一个项目，这就有可能导致外包的活要延期。另外，由于本身资金来源不是外包，这个难以严格把控，没有个制约的条件。 整理下总体的需求，低端的不谈，基本上淘宝就能解决这问题，也确实很多通过淘宝交易。谈所谓高端些的需求方，给钱，把事做漂亮，但是又没办法验证代码的质量，最基本的也就是通过使用功能看看有没有问题，看看界面做的怎么样之类的，随时催问下进度。当然也不乏一些有技术要求的客户，比如大公司项目的某一部分外包或者是已经做了一部分的项目二包，这种的是有明确技术要求的。长远来看，外包和自己构建团队开发的区别主要在于外包注重快速简单的开发，而自己团队往往考虑开发周期的同时也考虑项目的可维护性，这点几乎是难以避免的。我们对于这种方式有个解决办法是先找一个可靠的维护团队，再让可靠的维护团队找一个自己不认识的开发团队，通过维护团队来倒逼开发团队不可能做一些难以维护的事情。当然，对于平台来说，怎么做，或者怎么实现就很难了。另外一方面，从服务方需求来谈，服务方往往需要的是高质量的项目，这些包括，需求确定，资金充足，便于沟通，相互信任等，可以说有一半的问题都存在于需求沟通上，这个我暂时没有看到有一个威客平台去提供比较严格的需求模板来帮助用户整理需求的，都是给一些无关痛痒的，甚至是一般用户不理解的东西。然后签订好协议之后，就是开发阶段了，一般情况是需要制定流程，比如网站从原型图到UI 再到web前端&nbsp;再到后端部分，是需要一套较为规范的流程以及相应的审核标准。便于沟通这个来说，普遍用户习惯还是在于QQ和电话，比如传文件、屏幕演示、语音，当然缺点也在于举证麻烦，所以很多网站为了解决双方沟通问题，派客服去跟进去解决双方矛盾，一定程度上能缓解这个问题，带来的好处也是双方对平台的依赖性提高，坏处也显而易见，就是对于平台，这样人工成本太高。 解放号尝试解决的问题是利用合同和资金托管来解决需求方诚信的问题，用git提交物和代码质量检验来解决服务方诚信问题，固定佣金提成，不设VIP，也没有各种加急什么的。可以说，解决的是基础需求层次，但并未做更深一步的延伸。而猪八戒网又在高端领域做了天蓬网，比如设计类的规定哪一级别的设计师，每页不得低于多少元，开发类对项目时间、人力、价格三维做了对比参考，交易不收取佣金，对服务商严格审核，也算是进了一步，但老问题依旧，取证困难的问题依然没有得到解决。当然威客平台这种方式有个问题在于当然前提是网站有大量的客户流量，而且需要适当平衡双方，需求方太多，没有人接单也不行，服务方太多，抢一个单做，导致恶性竞争也不行。一般任务来说，有80%以上的都是常用需求或者类似需求，比如网站中&nbsp;微信平台基本功能&nbsp;关键词回复、自定义回复、优惠券、微商城、多级分销、各种促销推销活动，企业CMS站，商城、论坛、问答系统&nbsp;这些占大多数，能对这样的做一个统一的定价参考范围，也有利于需求方了解大致价格发包，服务方筛选合适的单子。 总的来说，解放号有着大量优质的接包方资源，但需求来说较少，也处于供需不平衡的阶段，很多服务商依旧把解放号作为第二选择，简单放心地拿到外包，但总量不太多。。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"解放号","slug":"解放号","permalink":"//www.zuohuadong/tags/解放号/"},{"name":"一品威客","slug":"一品威客","permalink":"//www.zuohuadong/tags/一品威客/"},{"name":"猪八戒","slug":"猪八戒","permalink":"//www.zuohuadong/tags/猪八戒/"},{"name":"天蓬网","slug":"天蓬网","permalink":"//www.zuohuadong/tags/天蓬网/"},{"name":"威客","slug":"威客","permalink":"//www.zuohuadong/tags/威客/"}]},{"title":"请不要吃那些狗狗了好么","date":"2015-12-23T06:14:51.000Z","path":"2015/12/23/dogs/","text":"狗是人类忠实的朋友，你看那些牛、马、鸡都是傻的，牛只会勤勤恳恳地耕地，就知道抢驴的饭碗，简直是可恶。而马也就被骑骑，没有马就不会有骑兵的厮杀了，这马害死了多少人？最可恶的就是那鸡，天蒙蒙亮就打鸣，就不能让人多睡会啊？你看看狗，狗可是会看门，任劳任怨，日日夜夜守着家，容易么？ 狗既然不是区别于其他动物，那老实说，牛，羊，鸡也挺可怜的，我们讨厌的那些害虫也是为了生存，他们也挺可怜的，其实整个动物界都挺可怜的，所以我们也看到了很多素食主义者，不过话说植物也是有生命的，因为他们都是生物，那我们最好是也不要吃植物了，既然扩大到植物，那微生物是不是也很可怜，我们不要呼吸了，不要治病了？ 我不知道这种思想是如何入侵我们价值观的？我们小时候已经是对各种各样的事物充满了偏见，蜜蜂是勤劳的，蟑螂是要消灭的，牛是忠厚老实的，狐狸是狡猾的。比如牛，它本身就是要在草原里生长，我们把它绑起来，命令他们耕地，动不动就杀掉，吃牛肉，拿牛皮做各种鞋子皮包，“你看，牛是人类的好朋友啊，生前勤勤恳恳，任劳任怨，死后又将自己奉献给人类。”牛是这么想的么？ 我们对待动物的情感总是以个人利益来区分，我们将对自己有利的统统称为朋友，而将对自己不利的全部视为敌人。 而作为食物链的一环，这些动物都有它存在的合理性和必要性。 如果将爱不爱狗强行作为一个人有没有爱心，这跟道德绑架其实也没有区别，你那么有钱，不捐款就是没有爱心。 况且很多爱狗人士也是有选择地爱，比如只爱可爱的，听话的狗，土狗不爱，因为土狗不可爱也不干净，藏獒也是，因为身上气味很重，太凶。有人会反驳我说，有人养藏獒，养土狗，但很多是看门护院，你微博上、QQ上见大家因为喜爱转发的有多少？何况很多爱狗人士往往对狗造成了伤害。比如为了救自己的宝贝金毛犬，买了一只土狗活活抽血致死。 这些人，他们知道自己不吃猪肉是不行的，而且猪大多又丑又脏，不像狗，时不时可以摸两下。 一个人拿着这种自私的情感，去衡量别人是否有爱心，这种人的心胸是狭隘的。甚至利用此，站在道德制高点去指责别人，这种行为是荒谬的。 当然不是提倡大家吃自己宠物，人非草木，孰能无情，但也对其他动物也有个公平的对待，也不要剥夺别人的权利。真正该打击的，是那些偷宠物，贩卖别人宠物的人。 佛教不杀生，甚至是对苍蝇、文字、老鼠也是如此，如果你爱护生物，也请对动物、植物、微生物也一同对待。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"爱狗","slug":"爱狗","permalink":"//www.zuohuadong/tags/爱狗/"}]},{"title":"冲击实体行业，罪在电商？是该发展还是创造就业机会","date":"2015-12-23T05:39:15.000Z","path":"2015/12/23/hualianwang-dianshang/","text":"图书、服装、家电等产品的实体店受到（电商）冲击最大，部分实体店经营困难甚至出现了关闭潮。部分传统的百货商场也受到较大冲击，经营景气度持续下降，这对相关群体就业带来较大影响。 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;——&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;发改委 发改委的逻辑一向比较跳跃，比如涨油价的时候相当干脆利落，轮到油价下跌的时候就支支吾吾了，总是以各种理由搪塞，比如前不久声称“雾霾严重，油价下跌汽车跑得更欢，这样不利于环保”就不降价了。 “尽管网上商品零售、快递等新兴业态创造了部分新的就业岗位，但也必须注意到网店对实体店带来的冲击和显著的替代效应。” 也就是说电商高速发展，其实是对实体造成了冲击，这是一种替代效应。 “图书、服装、家电等产品的实体店受到（电商）冲击最大，部分实体店经营困难甚至出现了关闭潮。部分传统的百货商场也受到较大冲击，经营景气度持续下降，这对相关群体就业带来较大影响。”这句话更深层的意思电商制造的就业已经无法弥补它所带来的失业，这种不对等不仅仅是数量，还有地域和年龄上的。京东冲击中关村就是一个很好的例子。 如果仅仅是到这，我觉得发改委是没必要说明最后一段话的，寓意恐怕在于把失业的罪责推给电商，发改委的出发点可能在创造就业上，下一步可能要出台政策抑制电商发展，或者是给各地政府警醒下。 但是我就一直没明白这是什么逻辑？ 举个例子啊，公交车通行之前，满大街都是人力车，大概1-2个人就能创造1个车夫的就业，现在公交车来了，30-50个人&nbsp;无人售票，一个司机就能搞定。现在发改委发话了，公交车冲击了人力车行业，造成了更多人的失业，罪责全在公交车。 换个例子，20世纪属于集装箱的时代，集装箱推动了经济的快速发展，但使得大量装卸货的码头工人失业，这些工人一部分开始了集装箱相关的其他工作，另一部分转入了其他行业。而马克思的生产解放理论也谈了国家发展需要解放生产力。从维稳角度讲，国家有必要创造就业机会，但不应该是通过限制新的技术发展来实现，而应该是帮助人民逐渐过渡到新的产业。 作为发改委，发展和改革目的也并不是仅仅创造就业机会而限制新的模式和技术发展吧。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"网络","slug":"网络","permalink":"//www.zuohuadong/tags/网络/"},{"name":"电商","slug":"电商","permalink":"//www.zuohuadong/tags/电商/"},{"name":"发改委","slug":"发改委","permalink":"//www.zuohuadong/tags/发改委/"}]},{"title":"阿里，放开市场，再谈市场问题市场解决。","date":"2015-11-17T17:26:12.000Z","path":"2015/11/18/ali-shichang/","text":"说实话这个问题很难解释，或者是因为淘宝大，或者是因为马云有影响力。 2015年双十一前夕，京东实名举报阿里逼迫商户二选一，其中真假不做辨别，也不是一两年了，各位可以退回几年前看天猫逼迫商户二选一的聊天记录，这事历来已久。 正常情况下，天猫双十一流量多，商户往往会抛弃京东选择双十一的促销，这样的品牌不在少数。天猫因为有淘宝，支付宝的用户习惯，流量为什么多不再累述，到底好不好，反正假货也不少。 好了，看看阿里奇葩的回应:市场问题市场解决。来来来，把这话给联合国说说:政治问题政治解决。给法律说说，杀人问题杀人解决。然后阿里投资的UC，新浪就开始煽动这事，引导大众指责京东。 阿里，你放开市场，再说市场问题市场解决吧。逼迫商户二选一真不应该是一个大企业应该做的事情。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"阿里巴巴","slug":"阿里巴巴","permalink":"//www.zuohuadong/tags/阿里巴巴/"},{"name":"淘宝","slug":"淘宝","permalink":"//www.zuohuadong/tags/淘宝/"}]},{"title":"淘宝假货多，真的是你太贪么","date":"2015-11-17T17:05:02.000Z","path":"2015/11/18/taobao-jiahuo/","text":"事情起因于淘宝假货事件，事后媒体总结:淘宝不是假货多，是你太贪。 先说说这句话的强盗逻辑，淘宝不是假货多，是你太贪。杀人，怪你太贱。抢劫，怪你太有钱。放火，你不顺眼。最重要一点，你假货是标着真货卖的，明显的欺诈。但如果你真标明假货，消费者还买，那就只好一个愿打一个愿挨了。 我是承认25元买不到劳力士，可是那些卖假货的也不傻啊，专柜价买到假货肯定也是有的，这能怪消费者太贪么？ 之前一做过淘宝多年刷单的朋友，总结了这么一句话:没有假货就没有淘宝。可见淘宝假货有多少，如今，时隔多年，淘宝很多假货也变成了“真货”，不妨各位去搜搜“皮包”，对，很多长得很相似，甚至一样，却只是牌子不一样，而差价竟达到50%。我跟你长得一样，牌子不一样，总不能是假货了吧，这招简直妙绝，不明真相的消费者，真以为他家折扣更低呢。 退一步来讲，淘宝作为一个平台商，无需为假货负全责，但仍有监管责任。我们看到的应该是淘宝的态度和决心，不应该是一句怪消费者太贪的文字游戏。 那有人又问了，这问题你有好的解决办法？有啊，假货问题，正品解决。允许已经核实的正品店铺举报调查，核实后有奖励，并且查封假货店铺。建立店铺的相互举报查证机制，只不过这样淘宝自然会投鼠忌器。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"淘宝","slug":"淘宝","permalink":"//www.zuohuadong/tags/淘宝/"},{"name":"假货","slug":"假货","permalink":"//www.zuohuadong/tags/假货/"}]},{"title":"为什么中老年人喜欢用这样的QQ表情","date":"2015-08-24T04:25:04.000Z","path":"2015/08/24/zhonglaonianren-biaoqing/","text":"前段时间豆瓣发起了&quot;中老年QQ表情大赏&quot;，网友们贡献了不少类似的表情，&nbsp;这类表情大多采取「主体+文字&nbsp;」的版式，图片主体通常是美女、鲜花、蝴蝶、婴儿、宠物、造型简单的卡通人物等。配色方面偏爱对比强烈，常见渐变发光阴影等效果，突兀生硬的拼接也不少见。&nbsp;&nbsp;对于年轻人来说实在很难欣赏这种审美，&nbsp;但同时，我们喜欢的表情和颜文字也很难获得他们的认同，&nbsp;他们觉得那不通俗易懂，难以理解。&nbsp;这种情况或许可以用「代沟&nbsp;」二字概括了事，但具体是什么原因导致的呢？&nbsp;或者换一种问法，是什么导致了两者间审美品位的巨大差距呢？&nbsp; =========================================== 任何一个产品其实都是先由技术提升，再回归审美提升的。就拿最初iphone来说，屏幕的高分辨率+内容拟物化的设计，让人感觉如此“逼真”，如果最初是高分辨率+扁平化设计，可能很多人会觉得这只是更清晰的诺基亚罢了。等到行业整体技术已经被拉到这种高度之后，回归“审美”，走扁平化趋势，就显得很跟进时代了。（做过设计的很多可能都深有体会，一些客户会觉得立体效果的更具有“技术含量”） 其实现在中老年人玩QQ时代更像我们06-08年那会玩QQ的时候，也只是重复了我们那个时代的审美以及好奇。在文字聊天时代，相对于文字，QQ默认的这些表情已经显得有趣多了。后来，那些像“年画”一样的表情也显得更有技术含量（神马彩虹色，显得比黑白有技术多了），后来的动图表情更是给这种“技术含量”提升了一个档次。如果QQ魔法表情支持手机端的话，我想也会像当时一样火起来。而我们这些80后90后，已经是经历过那个时代了，谁给发个会动的表情也不会引起大家好奇心了，反而是大家开始追求审美了。后来再火起来的就是H5页面了，网页居然可以像放PPT一样动起来，等到大家都习以为常的时候，真的就又是拼“审美”的时候了。所以，中老年表情只是一个技术上升的阶段，还没能停留在审美阶段。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"表情","slug":"表情","permalink":"//www.zuohuadong/tags/表情/"}]},{"title":"【转】我为什么要放弃机关单位在一线城市工作","date":"2015-07-16T06:10:07.000Z","path":"2015/07/16/aboutjobs/","text":"答主男，2008年某三流西安民办大专毕业，怀揣了2000块钱，我买了一张火车票，来到上海。这里没有任何亲戚，朋友，甚至因为跷课，当时的学校暂扣了我的毕业证。我到上海唯一的理由，是喜欢互联网。在这里，我合租在有9个人合租的一套房。小单间月租金650块钱。房间里只放得下一张床和一个笔记本电脑。 7月的太阳实在太热，求职问路基本靠12580。每周末去上海体育馆的招聘会，遇见突如其来的暴雨，浑身湿透根本不是个事，每天奔波而惶恐，我连毕业证都没有谁会要? 一个月之后我遇见了我工作的第一任主管，那天我求职时迷了路，步行走了一公里，找到面试公司的时候满头大汗。整个衣服湿透的，头发上的汗跟洗过了一样，中暑几乎站不稳，他递了我一杯水，然后让我聊了聊对SNS的看法，估计是他可怜我的落魄，他给老总打电话说暂时不要我的毕业证，先看看我的工作表现。 我进入到一家非常优秀的国内优秀的互联网公司，虽然工资只有1800。但我丝毫不介意，第一次参加例会，身边有了一堆来自迅雷，阿里巴巴，腾讯，百度的同事，知道了产品经理的这个职位，那人比我小两岁，是公司从盛大挖来的，他会用Axure，会用思维脑图，开会时能迅速提炼精髓，有着清晰的产品分析能力。分析互联网比我透彻的太多，遇见了正规军的我第一次明白，天外有天，我那点以往炫耀的知识根本连入门都算不上。 早晨6点半起床，挤地铁，为了节约，基本中午不吃午饭。别人去吃饭的时候我就一个人上顶楼的天台，对着上海的高楼大厦发呆。租住的住所卫生间的浴室龙头需要9个人共用，每天晚上做饭需要排队，上厕所的马桶只有一个，时间长就会被室友骂，电淋浴器的热水，别人用完了你就要等好久。每天到家写分析报告到夜里两点，困得不行就把闹钟设置到早上六点，然后睡觉。四个小时睡眠对我来说足够。当当满300-150的的时候，买了一大堆互联网的书狂补，周末，参加各类的产品经理聚会，不敢说话，只坐在最后安静的听。听他们分析，讲一堆我压根不明白的词，然后记在本子上，回家用百度查。 国庆长假，离家近的同事都回家，我一个人替全部门的同事加班，3倍工资的待遇让我用一个星期的时间买了第一部智能手机——魅族m8。 幸运的是我遇见了我一辈子的两个好哥们，公司里的一个PHP程序员和一个广告销售，我们三个人就像《中国合伙人》中的三个人那样一样形影不离，他们俩都是上海人。销售在我眼里算半个富二代，但特别努力上劲，比我在上海见过的很多外地人都要努力，这哥们与人打交道的人，各方面想法都更真实，本地人也有底气，他帮助我在各种情况下度过难关。经济，事业，感情……为了我们的项目，他甚至住在公司里过，程序员是个特别老实有点内向的男孩，执行力强很适合做程序员，总之，我们三个好的穿一条裤子。 付出当然要有回报，2010年，团购刚刚兴起，我们开始负责公司里的团购导航，这是公司的一个很重点的项目。我们三个每天都像打了鸡血，那时候从没有考虑过是否和公司给的待遇对等，我们都抱着创业的理想做。销售去北京出差，我俩聊产品从晚上8点打到12点，四个小时的长途，他会将访问客户第一手的资料给我，我迅速做产品要求，然后提交程序员，程序员加班当晚就做产品迭代。有时候半夜两点我们会突然想到点子，然后我会打电话讨论，加班到夜里三点是太经常的事情，张江满满的路灯和空无一人的街道，然后挡车送下属回家，再回家睡几个小时，接着赶到第二天公司上班。有时在夜里一点发现一个页面bug然后打电话给技术。他也会立即起来改正。 这是上海工作的人对工作的执着，绝大多数的人，只要是他份内的工作，你多晚打搅他都不会怪你，而且很负责。三个人的拼命很快有了回报，几年的时间，我变成这个项目的经理，我有一个近十人的小团队，他俩也都是各自业务的骨干， 上海的生活节奏很快，你感觉自己有一天不努力就会落后，这让你有了动力拼命学习，她的配套设施很好，张江楼下的便利店有很多24小时服务，你能在加班到半夜三点饿了的时候下楼钻进任意一间吃关东煮或者让店员用微波炉加热一个鸡块便当给你。 职位和收入上来之后，生活状态也变化了，周末可以去田子坊和女朋友逛街。从世博会看各国风光，去ChinaJoy找萌妹子拍照，去崇明岛抓小螃蟹，去阳澄湖吃大闸蟹，去松江大学城喝咖啡，坐在小店里看日落。自由的自己带着女朋友干自己想干的事情，去想去的地方。我的工资可以轻易的买得起IPAD,IPHONE,网购的东西基本第二天就到了，而且包邮。 我也遇见了很多我这辈子都佩服的人，他们是各个领域的专家。他们知识渊博，彬彬有礼，充满智慧，穿着时尚得体，说话恰到好处，做事井井有条。男男女女都好聪明，遇见他们你就会觉得，我也要努力变成这样。 再后来，搞销售的哥们开始带着我见客户，吃饭聊天，教我克服自己的弱点与人交流。过于内向是我的弱点，有了他的帮助，内向的我敢在公司战略会议上发言，为团队争资源，争利益。团队有一个正牌的复旦大学的中文系硕士和上师大的新闻学硕士。是的，作为他们的经理，我是西安一个三流野鸡民办大学差点没混上毕业证的大专生。 离开的时候。月薪10k。每年14个月工资，我知道这个工资在上海并不算高，但，其实，我觉得她对得起我自己的努力，至少我所在的公司，节假日3倍工资，晚上加班有额外工资，餐厅有免费的面包饼干方便面咖啡火腿肠，免费早餐。各种制度严格执行。 周围有同事收入比我高，但他们也确实比我强。学历，工作能力，为人处事。我输的心服口服。然后只要快速学习就好了。 上海是个神奇的城市，她不问你的出生，学历，不会鄙视你家庭条件，她只看你是否努力，真的。 ——华丽丽的分割线—— 2013年5月，母亲查处患肺癌，胸腔积液止不住，几乎丢了性命，我为了母亲离开上海，回到家乡，在这座并不算小的，我曾生活了20年的城市，我发至今无法适应。 家里的条件并不差，父母早年做生意，遭遇火灾，但我的生活还是并不拘谨的。作为独生子，家里父母自住一套房，05年给我买了一套房结婚用，去年家乡公务员分房又买了一套出租。加上早年购买的在外出租的几个商铺，当然，这些东西，每一分，都是父母这辈子的血汗钱。我在上海的拘谨，只是因为我始终有一个信念，就是不愿在毕业后花父母的钱，事实上我做到。 家乡属于三线城市，经济上并不是落后太多。但回来后的我还是很不习惯，公共车基本不准时，服务人员没有服务意识，办酒店入住，我在等房卡，两个服务员在商量中午吃什么。等办好了进到客房，才发现上个客人走了房间没有收拾。要知道这并不是小酒店。小镇忙的时候，吃一个菜要催三次以上，服务员一脸的不情愿，餐厅服务员的服务让我时刻有种想要投诉的冲动，想起在上海的红辣椒，普通的川菜馆，服务员时刻观察你的举动，帮你脱掉大衣，帮你倒茶。这个城市里的每个人都在很认真的生活，于是，有些时候，开始对家乡失望。 首先是没有合适的工作。 回到家乡后，我的职业工作并不好找，家乡因为物流和互联网落后，电商落后不是一点点。后来，母亲不顾我的反对，送礼托关系把我搞到了机关，事业单位。一年以后可以拿到事业编制。上班，没完没了的上班，维护稳定。上班基本没事做，有食堂有宿舍，所有的东西都不用花钱。就是不让你回家。好几天回一次家，只能在家待一天。有时候感觉自己像在养老院。你不需要太好的电脑知识，会重装windows设置打印机和路由器，在这里就是专家。会淘宝，简直就是大神。 其次，能力是个屁，人际关系和家族势力基本就是一切。 每天，机关服务大厅都有一些不满意的群众，有的吵架有的哭闹，我刚去的时候非常惊讶，但同事都习以为常。甚至好心的提醒我：不要管。管了就是你的事。 机关的小领导很势力，给我安排各种工作，在这种机关单位，你有能力，那你就多干活，没有能力你就混日子。反正月底大家拿的工资一样，一段时间后她知道我是某个领导的亲戚，对我的态度完全变了，什么都不用我干，还立即给我评了先进，让我哭笑不得。 你必须承认，这就是小城市的工作现状，你努力上劲根本没用，因为，谁该受到重用和提拔就是领导说了算，人脉和后台就是一切。 于是，新来的非编制临岗合同工，拿着全机关最低的工资，干着没完没了的活。大部分拿到编制的，日复一日的工作就是游戏，吃饭，睡觉，聊天，上网。 再次：你的仕途完全是巴结和拍马屁，而周围的人都劝你说：这是太正常不过的事情。 新上任的机关领导，每天的工作就是斗地主，每天中午都和某上级下派领导聊天，然后帮领导洗碗献殷勤，三个月后，他迅速升成了主任……回家后我诧异的跟母亲提起，母亲说很正常。反而认真的找我谈话，说我太死板，不懂得溜须拍马。我无法辩解，三观崩溃。 最后，所有人判断你是否成功的标准，就是公务员。 我有一个亲戚，托关系进了警察系统。35岁的他收入4000多元，开着20多万的车,，单位有食堂而且伙食很不错，却永远和一堆朋友去外边吃，用他的话说这就是人脉。因为看上一套别墅但父母不给买就和父母吵架。经常问父母要钱，就是这样的一个人，母亲无比羡慕，认为他很优秀，他是公务员，出门有排场，有灰色收入，生活有保障，这一切深深的伤害着我的心，我有时候特别想离开家。只是，我舍不得化疗后身体虚弱的妈妈。一方面她年轻时候一个人干着两份工作，白手起家到给我准备了两套房子若干间商铺，把这辈子的一切都给了我，另一方面却又在试图更改我的价值观，告诉我要在机关时刻防着别人，要学会溜须拍马。她不许我做生意，不许我找私企的工作，只想让我进机关吃大锅饭。 这真的不是我家的个例，是几乎这座小城所有人的价值观。任何的事情都要靠关系。 而且，这里有一群，是一大群三观基本一致的亲戚，茶余饭后的话题就是谁家条件好谁家孩子收入高谁家媳妇抽了婆婆一耳光。参加家庭聚会没完没了的教育你学会溜须领导，要圆滑处事，要多懂点脑子不要那么善良，你不参加家庭聚会就是你不懂事你不合群。 除非你完全按照他们的意思办。 其实我知道，原本两个世界的人，他们看不懂我的内心的想法，他们没有经历。也许我也不懂他们的良苦用心。我回来的半年几乎没有跟父亲讲过话，因为他一直固执的觉得，那么多人在北上广打拼，有几个人拼成功了?还是回家乡做个公务员吧。 他们要的就是你回家，有份铁饭碗的公务员工作，找一个能照顾你的善良姑娘，赶快结婚生个孩子，过他们眼中完美的生活。生活本来就该是平庸的。 如今的我就生活在这种种不如意中，在看似富足却有些苦楚不安的状态下生活，我知道，我永远不会为了升职而去拍领导马屁给领导洗碗，我无法成为自己原本最看不起的人，我在机关单位永远没有前途。 我更知道我有一天会回上海的，哪怕会变成房奴按揭。我不在乎自己是否有房，因为我有理想。留在上海，让我的后代有更好的生活，已经是我此生最大的理想。 回答你的问题： 我也知道家乡安稳，衣食无忧，在家乡我不需要一分钱贷款，买辆好车拉着姑娘过平凡的生活。吃吃饭看看电影。每月1号的时候穿着大拖鞋到租客那里收租子。 我也知道北上广房价高也许要做一辈子房奴，买杯豆浆还要排队，坐地铁挤得像汉堡包，买辆车还要摇号，一个破车牌8万块。 那年幼稚的为了省钱不吃早饭的自己付出的代价就是如今每年体检都要观察随时准备切除的胆囊上的息肉。 你以为我不解亲情，为了一点钱放弃家乡到4000公里以外的城市拼的昏天黑地，看不到父母日益的年迈，就是为了回来过年聚会的时候喝着咖啡笑着告诉你我收入比你高? 你还说我虚荣我自私我价值扭曲? 我知道，再也遇不见那个陪我住650一个月的房子，给我做饭学削土豆皮弄伤手指，我发烧时整夜跪在地下给我换毛巾的女孩子了。 我再也遇不见为了一个页面的用户体验几个哥们争得面红耳赤约好下班吃火锅边笑边骂对方傻逼的铁哥们了。 再也没有在办公室被经理骂的狗血淋头然后回到家努力改一个用户体验报告到半夜2点半的自己了。 那些放弃了家乡富足生活去一线城市打拼的，都是有理想有希望的孩子，他们才是这个国家各个领域改变的希望。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"工作","slug":"工作","permalink":"//www.zuohuadong/tags/工作/"},{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"}]},{"title":"浅谈人人网产品和运营","date":"2015-03-31T15:45:21.000Z","path":"2015/03/31/qiantanrenren/","text":"时隔一年，还是将之前的见解发出来，恐怕之后再没有时间去研究了。 作为一个“新人”，对人人并不够了解，甚至没有资格来说这，但是从用户的角度来说，对人人有着感情和不同的见解，还是希望能作出一些有用的见解。&nbsp; 分析篇 上人人，找同学。 这句话几乎成为了大学生众所周知的话，而现实情况是，经常联系的同学，会通过电话或者微信来联系，见面的第一留的是电话，其次是微信。因此人人的好友大部分是相对弱关系圈子的朋友群体，这些群体的朋友很多情况下只是偶尔联系，或者是在评论状态。人人处于这样一个尴尬局面。 对于一些”一面之缘“的朋友和失去联系的老朋友，通过人人网（实名/照片）能找出这些人，然后进一步联系。大学生活充满了这种”不确定性”，人人恰好可以帮用户找到。 &nbsp; 2.**大学生需要什么样的社交？** “陌陌”的发展，一定程度上说明大学生是缺少这种东西的，随着现在许多学生功利性越来越强，电子设备的发展迅猛，导致了日常线下交流的减少，另一方面，很多大学生生活比较悠闲却还是没机会去社交，只能去贴吧发发牢骚。自从陌陌被打上“约炮神器”这种目的性标签后，一些渴望”校园爱情”的正经人就和它划清界限了。通过微信只能和自己认识的人在一起聊天，这种碰撞往往是有着确定性的，于是越来越多的人将方向转向贴吧（部分校园是论坛），希望通过贴吧来结识一些好友慢慢发展，可是贴吧虽然人多，却也不具备这种气氛，即使是后来推出贴吧群组，仍无法满足这部分群体。 首先这种社交应该是充满不确定性的，能认识一些新的好友，其次社交平台应该充分提供互动，原因在于，这部分用户有戒备心理，不愿意去聊，社交网站通过”互动“来减少这种目的性，增加双方的信任，从而避开“约炮”这种目的性问题。 &nbsp; 3.”**校园广场“**的尴尬。 从定位上来说，这款产品没有错，主打校园市场，但是人人却没给用户一个使用”校园广场”合适的理由，缺少一个闭环效应。 &nbsp; &nbsp; 大学人人网的使用频率往往会高于新浪微博（校内交流），而人人却依旧在流失用户？ 这不仅在于人人在校内的长期沉淀，通过人人可以认识更多校友，这些人都是实名的，因此通过人人网来联系校友相当靠谱，这虽然给添加好友提供了一个很方便的方式，但是，如果是熟人，可能回 运营篇 每次的活动目的不够明确。 虽然受众主打高校学生市场，但是缺乏引导消费和刺激消费，主要依靠广告来赚钱。 运营上，没有考虑到不同地区的实际情况。 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 产品篇 现有基础上改变： 1.校园广场调整为好友状态中层推送（类似于新浪微博广告），侧滑可以直接切换到校园广场。 2.校园广场增加签到积分制度，增强用户粘性。 3.增加校园广场云平台制度，校园广场帖子按照积分（帖子数X1+回复数X0.2）由管理员开通新功能【优惠卡/会员卡/商家中心/订餐系统/交友系统/会员等级等各类插件】 管理员可以自行联系商家解决这些问题，当然，运营这块要做好反欺诈行为。 4.和京东或者顺丰嘿客合作，做好友送真实礼物功能。增值服务收入。 5.附近的人动态（这个需要注意用户隐私问题），显示状态的原因是因为，如果只显示用户照片和昵称，直接聊天会引起用户警戒，而对状态的评论，则能减少此问题。【注意附近人的广告机推送问题】 6.加强”暗恋“功能的使用，搭配附近人是一个很不错的功能，每个人只能暗恋3-5个人，不限男女，当然，选定后3周内不能更改。如果双方同时暗恋，会收到通知。 7.优化发布照片功能，人人网的手机客户端，发布照片的时候，选择相册中的照片，尤其是在照片比较多的情况下，会相当卡。 8.广告推送问题，一些商家注册成“人”，然后不断加好友，同时发含有广告的状态，严重影响了用户体验。(建议通过IP数据库检测等方式配合举报制度来解决) 9.网页版编辑器的更新问题，无法复制图片和链接（建议使用百度开源ueditor编辑器）。 SEO优化问题，网页版在百度搜索权重问题，百度搜索到的很多东西往往是百度贴吧，当然这肯定不排除百度自家产品的原因，但是在使用过程中，发现的主要问题是校园广场并未做SEO优化方面的努力。 &nbsp; &nbsp; 新理念的提出： 积分体系/**开发者中心/**签到排名 我一直在找一个理由，说服自己使用人人。对，周围很多人在问我，为什么使用人人，现在很多人联系都在用微信，甚至QQ都卸载了，”约炮“用陌陌，发状态用”新浪微博“，校园则使用贴吧或者论坛，似乎人人网无法给一个使用的理由。 群组式社交——回归本质，聚落，关系网，兴趣圈，那~你总会有一个感兴趣的理由。 群组式社交并不简单的是将现有状态转变为群组形式，主要是在于它的灵活性，或者说它甚至可以演变为现有互联网的任何基于信息类的产品。 &nbsp; 发现：（生活的美好，只有认真才能发现） 【提问】任何人可以在此提问，无论是个人/团队/还是企业，&nbsp;&nbsp;不论是神回复还是有益的回答，你总该能找到和自己臭味相投的那个人。 【距离】你可以看到好友的距离，如果突然和你来到一个城市，你会收到提醒（该功能由用户选择开启），那么，是时候和好友相聚了，哪怕只是一句亲切的问候。、 【周围】周围人的状态：茫茫人海，你总会找到那个他/她。 【地图】你可以看到所在学校详细的地图，并可以在上面标注以及看到其他人的标注，这里是住宿的地方，这里咖啡馆味道不错。总之，这张地图更具有实用性。打通O2O，会员卡/优惠券/活动等。 群组:（回归社交本质，人的关系其实就是一个个的聚落） 聚合版块/圈子/话题/标签/淘帖/专辑/贴吧/公众平台/校园广场为一体，可分可合。 【加入有权限发帖，关注将会推送到状态。】 “群组”模式允许用户自由建立，并且群主可以设置其他用户是否可以自由加入，未加入用户是否可见讨内容。群首页将类似于现在人人公共主页，如果是群内成员，还可以看到帖子区和讨论区，帖子区类似于现在论坛版块，加入的用户可以自由发帖（包括在个人首页发状态的时候同步到群组），讨论区则是现有“群组”的延续，用户可以像微博一样随时发信息，这个信息是会推送到其他用户那里的，当然其他用户也可以设置不推送。 每个群组都可以根据需要使用模板，如：默认群组模板、问答模板、图片模板（适用于摄影等）。 &nbsp; 全封闭式群组（加入需严格审核，未加入用户不可见内容），则适合于社团，创业团队进行内部讨论以及资料交流。 封闭式群组（加入需严格审核，未加入用户可见内容）的话，群组则会像杂志一样由加入的这些用户提供优质的信息，用户可以点“关注”进行信息订阅。 开放式群组（用户可以自由加入，未加入用户可见内容）的话，群组则像一个论坛，允许一些感兴趣或者志同道合的人来进行讨论。【校园广场是属于特殊的开放式群组】 &nbsp; 封闭式群组的(公众账号)玩法：（集合人人公众主页/小站/人人公众平台） 企业 企业可以定制内部的信息群组（对外） 让关注企业的人可以随时通过企业了解招聘及能力需要，了解企业文化。 团队 如果有想法创业，想找到志同道合的人，也可以通过建立自己的群组。 可以设定项目，提出想法，以便于更多人关注和投资。找到志同道合的人。 个人 我们提供了信息推送的模式，方便个人将一些诸如管理技巧，发布在群组上。 其他用户可以关注此类信息，来提升自己的能力。 &nbsp; &nbsp; &nbsp; 状态：（关注的群组信息/关注的用户信息/特别关注的群组） 通过数据算法，保证用户每次看到的不同群组内容都不同， 你总该会看到不一样的东西，去探寻你喜欢的信息，或者~喜欢的人。 &nbsp; 发布： 用户可以直接发布新鲜事/照片（加或者不加标题均可），但是必须同步到某一群组，默认群组为用户所在校园。","tags":[{"name":"人人网，产品","slug":"人人网，产品","permalink":"//www.zuohuadong/tags/人人网，产品/"},{"name":"运营","slug":"运营","permalink":"//www.zuohuadong/tags/运营/"}]},{"title":"浅谈人人网发展","date":"2015-03-31T15:42:44.000Z","path":"2015/03/31/renren-fazhan/","text":"时隔近一年，今天有人问我怎么看待社交，于是翻到这篇文章，发出来。 &nbsp; 通篇写了3**小时之久，也算是将我最近的想法全部倾出，以感谢人人对我的信任。还望能看完所有。** &nbsp; 机遇与挑战： &nbsp;&nbsp;&nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;由于很多学生毕业开始上班后，就不怎么接触人人了，所以人人网才提出“走出校园”，想进一步扩大人人的市场，只是没想到现在很多学生也开始摒弃人人，转为贴吧和校内论坛。 后来的微信平台的异军突起，如“武大助手”。学生自媒体app平台的普及，如简网app以及“青梅”等平台都在蚕食着人人的校园市场。 &nbsp;&nbsp;&nbsp;&nbsp;而人人提出“重返校园”已经是在这些自媒体兴起之后了，“校园广场”算是人人网走得比较对也比较狠的一步棋，毕竟人人在校园市场还是有一些地位的，但可能是由于时间仓促，看到人人网的“校园广场”的整个布局和运营有点不协调。 即使是部署“校园广场”人人也只是在和校内论坛以及贴吧在竞争，并未触及到更深的一些层次，因此即使是改革，人人 &nbsp; 深层次的需求分析： &nbsp; 1.人人网公共主页（表白墙）：这东西曾经火了很长一段时间，但最后由于不便于操作等问题，渐渐失去了学生的关注。 2.微信公共账号（签到/**交友/**校园八卦）：一些微信融合了校园很多的功能，甚至在交友互动方面做得相当不错，也赢得了不少关注度。（比如：武大助手） 3.校园广场（夜间话题）：11点以后往往很多学校断电断网，学生也开始躺在了床上，于是我在校园广场做了如此的实验：夜间话题，第一次来学校的感觉。发现整体反响明显强于其他帖子。 4.附近的人（陌陌）：微信虽然很早就推出了此项功能，包括摇一摇、漂流瓶、但是很明显的能感觉到大家使用频率降低了，陌陌算是这方面做得比较成功的，但是也存在一个问题，用户交流意图太明显，很容易让人产生防备心理。 小结：从以上四个问题可以看出，学生有很多空闲的时间在玩手机，交友这快潜藏着巨大的需求，而没有一款针对学生的APP能完全将交友这块市场精准把握。 学生/**商务交友（未来）：**其实人人走出校园的方案本身没有错，学生这部分市场随着市场的缩小以及技术的发展，还会再进一步萎缩，但问题就在于怎样走出校园，大学生毕业以后，大多数都在企业或单位工作，人人网的作用就没那么突出了，开拓商务交友也许将是人人走出校园的唯一出路。 &nbsp; &nbsp; &nbsp; &nbsp; 在看我的最终规划之前，还需要您了解： 这是我之前写的一篇文章，希望您略读。 【在这里是为了说明信息以及用户互动的重要性】 BBS是社会化产生内容的网站，而它本身的这个特性，一方面能产生大量的内容，一方面也产生了很多水化的、没用的内容，导致可读性、内容价值越来越低。现在人们的时间宝贵，对信息精准、有用的要求越来越高，所以BBS必须要解决这个信息问题，一个是内容的质量，二是索取方便！这样才能提升BBS的可用性和价值。 BBS的弊端是明显的，而至今仍未能彻底解决这个问题，反观微博，有价值的信息得以传播，因此微博火了。 但微博只是暂时的，SNS**才是永久的：** &nbsp; SNS网站带来了前所未有的大交往平台，它使得人们以往彼此独立的各不同类型的社交圈产生了融合，消弭了各人际圈之间的界线，由此可能会带来交际的尴尬。戈夫曼曾提出情境决定论，认为人依据不同情境做出行为决策，而情境是分割、独立出来的。每个人都会依据不同的社交圈(情境)决定自我展露和社会渗透的程度，人都会对某些人保留一些秘密，而对另外一些人敞开心扉。但SNS网站却带来了梅洛维茨所说的“地域消失”效果，或会使人们失去言行前提，让人感到无所适从，这可能对现实的人际交往造成麻烦。也许有一天你突然发现你的老公竟和自己的初恋男友联系上了，并且知道了许多你以前的事情，而这些是你不想让其知道的，有可能会给你带来意想不到的烦恼，那么此后你在社会化媒体上的行为一定会有所拘束。SNS网站在某些方面并不契合中国人含蓄的民族心理和内敛的民族性格，为了避免越界尴尬，一些人只得放弃使用。这一点也可从短信息在中国十分受欢迎上得到佐证。 &nbsp; 同样，SNS**存在的问题不可忽略：** 当代中国人处于两难之中，人们渴望与他人情感交互，但又觉得这样做太浪费时间无益发展，现代人是孤寂的“罐头人”。人有沟通的需求，需要向外界表达和释放，但是由于时间有限、交际面狭窄、忙于生存发展，人们每天和他人交流的时间极少，所以经常出现人的自我传播，自言自语，包括独自哼曲唱歌。现代社会竞争激烈，人们的生存状态普遍不佳，凡有进取心的人大都忙着奋斗，于是很少舍得花时间与人沟通。就算有交流，也很少有人愿意花时间去说一些对现实发展“无用”而被认为是“废话”的话，沟通主要以工具性为主，而SNS基本上属于闲聊性质。 通过以上问题，我们大概可以了解到： 1.BBS改革是必然的。 2.SNS在国内仍有发展潜力，但是内容“无聊”。 &nbsp; &nbsp; BBS+SNS**的模式（即：内容+互动）会成为BBS发展的一个新方向。** &nbsp; 内容寻找用户： 一般在BBS我们需要花很多时间去寻找自己真正需要的内容，而新BBS要实现的则是内容去寻找用户，这点可以通过SNS化来解决。 我们注意到在9.0关注用户的前提有两点：第一是某人发布的内容精彩，第二是这个用户你认识。 但是无论基于哪种关注，对方发布的信息内容基本是符合你口味的（实现了内容寻找用户） 互动性： SNS在互动性方面有着BBS难以比拟的优势，同样的用户，在SNS可以更简单地去对自己喜欢的内容进行评论，还可以对喜欢的内容进行分享，达到优质内容通过用户得以传播，而不是通过置顶主题、顶贴。 多样性： 传统BBS只能将帖子的标题展示出来，而需要查看详细内容则需要继续点击。SNS可以将图片、音乐、文字直观地展示出来，增强了用户体验，也提高了用户互动。 “无聊&quot;性： 也有相当一部分用户是无目的去逛论坛的，贴吧的方式使得这些无聊用户第一眼就看到自己喜欢的内容，这点在phpwind9.0中得以佐证。而SNS的无聊性甚至要比贴吧还高，因为除了无聊之余，看别人发的帖子，你还可以去和一些人”交友“，如果有聊得来的人，这个用户会直接从偶尔看看变为常客。 当然还有一些其他的，我不再一一列出…… &nbsp; 文章出处http://www.zuohuadong.cn/post/24231d_d0447d &nbsp; &nbsp; 有关近期的规划： &nbsp; 近期的规划也算是比较保守了，理念是整合资源，让人人更易用。 合并人人主页和群组模式： Discuz很早就推出群组这个功能了，只是在后来版本中发现他和版块有一定的冲突，（当然，我们的人人主页和校园广场在一定程度上也会起冲突）于是Discuz推出了群组推送功能，而后又有了“订阅”、“话题”等进行资源的再一步整合，可谓是越来越繁琐，用户越来越不知道用什么了，而phpwind则是直接砍掉了群组，认为群组和版块本身就是一体的。合并人人主页和群组，当然要具备二者的共同特征，这里简单说明下。 新“群组”模式允许用户自由建立，并且群主可以设置其他用户是否可以自由加入，未加入用户是否可见讨内容。群首页将类似于现在人人公共主页，如果是群内成员，还可以看到帖子区和讨论区，帖子区类似于现在论坛版块，加入的用户可以自由发帖（包括在个人首页发状态的时候同步到群组），讨论区则是现有“群组”的延续，用户可以像微博一样随时发信息，这个信息是会推送到其他用户那里的，当然其他用户也可以设置不推送。这样的好处是什么呢？ 例： 如果是全封闭式群组（加入需严格审核，未加入用户不可见内容），则适合于社团，创业团队进行内部讨论以及资料交流。 如果是封闭式群组（加入需严格审核，未加入用户可见内容）的话，群组则会像杂志一样由加入的这些用户提供优质的信息，用户可以点“关注”进行信息订阅。 如果是开放式群组（用户可以自由加入，未加入用户可见内容）的话，群组则像一个论坛，允许一些感兴趣或者志同道合的人来进行讨论。 允许用户关注其他“群组”： 说白了就是，用户不仅可以关注其他用户动态，切换后，也会看到群组内部信息整合后的一个动态，这样的结果就是用户可以定向关注到更多自己想关注的东西，而不仅仅局限于好友圈，比如关注科技，就可以加科技类组，大家一起讨论和查看相关信息。 个人主页状态同步群组： 如果将所有状态全部归为群组模式，（个人吐槽类的归为人人默认群组）那么每个人的状态将会显示来自于哪个群组，便于优质群组信息的传播和关注，各个群组之间也会产生高质量信息的竞争。 群组和校园广场的问题： 校园广场其实也可以理解为特殊的群组，只不过功能和限制有很多不一样的地方，比如校园提供表白墙，夜间话题等特殊功能，管理员可以自己进行建立与校园绑定。 用户互动问题： 群组（校园广场）存在很多有机会接触的人，人人网可以提供便捷的交流方式，提供“特别关注”功能，以及更方便“暗恋”，送“礼物”等功能。用户可以通过基础的互动以及资料的了解，来一步步发展双方的关系。当然也存在普通朋友间的互动。 &nbsp; 关于人人网的推广和进一步发展： &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;例子：宝洁公司最初曾秘密研制了一款异味清除剂，当时去拜访了家里有一股臭鼬味的女士，试用之后效果相当不错。于是宝洁打了一则广告，大意是：使用这款清除剂可以消除尴尬的异味。可是正式推出产品的时候却无人问津，原来很多人使用过后，都直接扔进角落了，原因是当你习惯了异味以后就很难觉察出了。于是宝洁打了第二则广告，大意是清洁屋子后别忘了使用异味清除剂，可以为您的屋子增添香味。结果此产品大卖。 &nbsp;&nbsp;&nbsp;说这则故事的原因在于人人网现在也陷入这种尴尬境地，成为了寻找老同学的一个工具，当加完朋友后，聊两句，索要微信号/QQ号，然后可能就没人人什么事了。人人真正要做的应该是在学生无论的时候，打开人人，可以看到自己想关注的人和信息，可以为自己每天的生活增添一份多彩。当自己有需要时，总能通过人人寻找喜欢的人，校内的信息，便宜的二手物品。无论怎样，当自己需要的时候，就打开人人，总能找到自己想要的东西。 &nbsp; 人人的未来： &nbsp; 不知道以我对人人的了解，说这些是不是有点假大空，但是还是忍不住说些自己的看法。 这个方案其实是我之前一个创业的初期想法，想到人人网拥有更多的大学生资源，于是便写了出来，可能并不是很符合现在的人人网，但实行起来想必会比创业团队容易了。 方案要实现的效果：对于企业来说，人人网的“资料库”就好比企业面试的全方位成绩单，用人单位只需要对接或者查看“资料库”而不需要面试就可以对学生做出精准的定位。对于学生来说，通过“资料库”可以更方便地找到企业，“资料库”成为学生必不可少的类似于“诚信档案”的东西。 既然是做商务交友，免不了对学生资料的进一步收集和分析。方案如下： 与企业人力资源管理部建立长期合作关系，定向推送人才，同时企业允诺提供一定的实习岗位。 根据学生专业和就业方向选定人生： 大多数学生可能知道自己以后想做什么，但是不知道除了学校的知识，他们还该学习什么，掌握什么技能，人人网可以从合作企业那里提供企业所需要的能力，以及掌握该能力需要的相关书籍，那么学生从大一就会知道自己该做什么，而不是一直这样迷茫。 2.**建立学生实习/**兼职资料库。 学生可以通过人人网获取适合的实习信息，用人单位通过学生表现，给予一定评价和评级。 学生实习记录以及评级和评价将作为以后毕业的参考。 另外学生也可以通过人人网获取适合的兼职信息，当然，用人单位会给表现突出的或者特别差的一定评价，这样的好处是，通过人人网去兼职的学生一定不敢投机取巧，因为用人单位的评价可能会影响他们以后的工作。 3.**调查表以及全面的人才分析：** 人人网定期设定调查表，对学生各个方面进行评价，作为上述信息的补充。 4.**人才开放平台：** 企业可以免费/付费增值来获取到企业所需要的相关人才。 （该方案仍处于试验阶段，所涉及的一些问题，我们还在解决，因此只是将想法简略地写一下，如果需要更深入了解，可以再详谈） &nbsp; 关于人人的盈利： 手机游戏 手机游戏基本是腾讯的微信占据了半壁江山，如果只是一味地模仿，很难打出自己的一片市场。不如再学习开心农场模式，让好友互动成为游戏的主要组成部分，而不是次要组成部分。 朋友送礼（实物） 非现有增值服务（考虑中） …… 这个目前我还没一个完善的方案，不过相信很快就会出来，再次感谢您能抽出时间来看这篇文章。 &nbsp; &nbsp; 2014年4月22日凌晨","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"人人网","slug":"人人网","permalink":"//www.zuohuadong/tags/人人网/"}]},{"title":"马云的华丽谎言","date":"2015-02-06T00:56:40.000Z","path":"2015/02/06/mayun-huangyan/","text":"做一个成功的商人，他确实做到了。但是这背后依然是华丽的谎言。 演讲三部曲，1.大家都来淘宝吧。2.之前没做淘宝的人都后悔了。3.未来是电子商务的时代。 事实：电子商务兴起源于物流成本的进一步降低，中国电子商务的畸形发展，依然得归功于税。未来电子商务会进一步发现，但实体店不会完全倒闭，而是处于一个转型期，有的转向服务，有的转向o2p，24小时便利店就是一个例子。 阿里的电商很牛逼。业内一直说，没有假货就没有淘宝，有人出主意，淘宝授权打假权力给正规店铺，相互也可以举报，有奖有惩，如果基于这个方案做一整套规则，假货可以消除很多，但淘宝敢那样做吗？另外，很多店家的销量是刷上来的，淘宝甚至有存在好几年的刷单漏洞没敢修复，原因也是会死一大批商家，所以用成交量上还是要大打折扣的。 马云说京东是悲剧。切不论人员管理问题，论模式，其实早有定论，马云做的淘宝+菜鸟物流和京东全国的各地的仓库，拿互联网的BGP技术和CDN技术对比下就什么都明白了。o2o，o2p也是同样的道理。 当然，作为一个企业家，煽动性演讲，鼓吹梦想也是情理之中，那我们就做个辨别是非的人吧。 我们所生活的世界其实本身就是在模仿互联网的一个过程， 所谓互联网思维迅速发展的一个关键在于试错成本低，用网络实现类似想法的成本远低于现实，因而也就造就了这种思维的快速发展。 说到底，互联网之于传统行业，改造的是产品，颠覆的是模式。 表面上是互联网离不开传统行业，实质是传统行业离不开这种低成本的解决方案。 好歹互联网也是一种信息传递工具吧，其根本价值在于人与人的连接。就像电话不一定是做生意的人在用一样。互联网亦不等于电子商务。 且见大虚拟时代，现实世界是如何重现互联网的过程。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"阿里巴巴","slug":"阿里巴巴","permalink":"//www.zuohuadong/tags/阿里巴巴/"},{"name":"马云","slug":"马云","permalink":"//www.zuohuadong/tags/马云/"}]},{"title":"易信~在短信与大互联网时代的十字路口","date":"2014-12-22T03:45:07.000Z","path":"2014/12/22/yixin/","text":"自从易信上线第二天，我就开始使用了，当然重点还是冲着免费短信去的，我也相信有很多人和我一样。 确实，在这个互联网时代，各类网络通讯工具的发展，短信已经不是那么必要了，依旧保持着0.1元/条的资费也的确显得特立独行。尽管飞信各种体验差，但在那个时代，能发免费短信确实是“生来骄傲”。也就是慢了这么一拍，易信已全然面对一个新的环境，我们称之为大互联网时代。 尽管易信的偶遇和拼车族做得相当不错，却依然难以扭转其面对微信而言的颓势。 我们为什么用短信？ 门槛低，包括智能机和功能机都可以使用短信，而且默认是不需要装额外的软件的。 文化基础，中国人很多事情不好意思当面说，短信在中国这种文化下，成为了最流行的通讯方式之一。 消息必达，只要对方开机就可以收到短信，不像很多通讯工具一样需要登录。有意思的是，企业在这方面需求迅速扩张。 易信的免费短信已不再是亮点？ 君生我未生，我生君已老 易信真的是有点生不逢时，如今微信已经十分普及，运营商的短信也是各种送，对于易信的需求依然不是那么大了。其次，缺乏一定是事件营销，这点其实还是比较遗憾的，整个易信的推广模式是免费短信，免费电话留言，送电信流量，内部强推。哪怕是留一个免流量的BUG（比如电信用户通过易信浏览网页不计流量）也没做。 分身乏术 最近注意到易信更新后的一个细节，在有未接来电的时候，易信会弹出消息，通知你免费回拨。其实易信也是有心去替代用户拨号软件的，怎奈自己是个“微信”，易信最蹩脚的地方应该在于，自己作为一个类似于微信的通讯软件，但是却更符合做“微信电话本”，其实易信又为何不能作一个“电话本”呢？ 平台又何尝不可 易信作为一个通讯类软件替代短信/电话&nbsp;成为一种平台服务也是不错的选择，提供可以替代系统短信电话的软件便于用户安装，其次提供开放的API，通过与MIUI、乐蛙这样的第三方ROM合作来建立起自己的生态也是一个很不错的选择。偶遇和拼车族可以像MIUI便捷服务那样，与短信界面融合。当然嘛，既然开放了API就肯定需要注意垃圾短信的问题了。 作为盈利点，最近两年来说，企业通知和验证码类短信迅猛增加，通过与企业的合作，收取一定的费用，也是可以赚钱的，当然，你的前提是用户基础足够大，信息保证到达。（有人提出验证码本身是用于安全目的的，网络短信接收的可不一定是用户真实的手机号，其实这点做好相关绑定和安全工作，还是有理由相信网络短信的安全性的），当然电话验证码/留言什么的也类似。 短信=多样化讯息 灵感来自于表情的转义字符，通过特定的字符（可以承载在普通短信），结合网页，在普通短信上显示网页链接，而在自己平台直接展示出来（比如附件、图片、语音等）作为一种标准化服务体现。 飞信能火的另外一个原因 其实飞信能火，不完全是因为免费短信，造成用户量剧增的就是其消息下发的功能。比如学校班级发通知，老师是强制要求加大家飞信的，这样就造成这个“圈内”大家都有飞信。这种近乎爆炸式的成长与黏性促成了飞信的活跃。 仔细看这种模式，其实就是“圈”和“自媒体”，将微信的“群组”搬到短信上，将微信的“自媒体”搬到短信上，再通过短信的特性将其发挥到极致，这种消息必达和低门槛的方式或将引来新的体验。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"易信","slug":"易信","permalink":"//www.zuohuadong/tags/易信/"},{"name":"短信","slug":"短信","permalink":"//www.zuohuadong/tags/短信/"}]},{"title":"大众点评有感","date":"2014-12-18T07:47:20.000Z","path":"2014/12/18/dazhongdianping/","text":"&nbsp;时间仓促，不足请见谅…… 团购的发展 对于团购来说，起初Groupon团购通过单一产品打造爆款，给予消费者一定的折扣。后来引入国内的时候，各家大打价格战，团购价格一度2-3折。受于地域的影响，单一产品不能满足用户需求，团购的东西地点不一定能满足所有人，因此多产品的团购逐渐成为了趋势。现如今团购已成为一种常态，对于用户来说，提供了更便捷的付款方式和服务，现由美团、糯米、大众点评三分天下。此时的折扣优惠已经在8-9折。对于商家来说，通过团购打造口碑，让小店有着更多的曝光机会。但随着团购的发展，问题也随之而来，由于团购价格和商家会员卡优惠相近，并且随着扫微信二维码的普及，商家拉会员有着越来越大的可能。目前来说，团购开始趋于理性，越来越多人会在权衡各种优惠之后做出选择。另外一个问题在于，30-50岁用户如何使用团购？这部分人往往是成功人士，不屑于团购，或者是不会使用、不想使用。体验是客户所感受到的一切 由于了解不深，在此只谈客户端的用户体验： UI来说，整个界面不够简洁明了。消息推送来说，有点像人人小秘书，用户点击率并不高，但是体验不够好。并且在券比较多的情况下，WP版的有距到期还有多少天，而安卓版的没有。并且我也抢到了相当多的一元秒杀券（由于客户端秒杀机制问题）。 点评的优势与重点 点评优势在于有着优质的商家信息评价，而目前的重点在于O2O闭环，通过在线订座、搜搜地图搜索路线、滴滴打车出行、微信支付。 自媒体与点评 西安老妖算是有着不错影响力的吃货，比如我想吃饺子，能通过老妖的微信平台找到好吃的饺子馆，当然，我为了一顿好吃的饺子，是不在乎距离的。而大众点评主要在于优质的用户评论，对比周围的商家评价，再看看要不要吃饺子，可能觉得这家包子评价更高，选择吃包子。对于要求较高的用户来说，显然前者有着更好的体验，全城的好吃的总会比某个地域多一些。从购物的角度来看，购物由团购演进为中立消费决策平台，提供最真实的低价信息给用户。那么，自媒体一定程度上在做“独立客观的第三方决策平台”。 为什么要有故事？ 对于商家来说，比如一个披萨，用着最好的油，最好的料，做出一个有逼格的披萨。但是对于用户来说，他所看到的只是一个披萨。商家的这种唯物主义与消费者唯心主义本来就是有着冲突的。 如何打造点评的爆款？ 1.新浪微博曾经通过名人效应来吸引用户，点评可以通过名店的独家合作（让利给商家）从而获取口碑效应。当然，对于这样的精品来说都应该有着自己所坚持的理念，背后的艰辛故事（诸如店长的创业路，坚持的理念等）做一个有逼格的店。 2.屌丝店（在小巷或者高楼但是特别好吃的店）通过对店的历史的介绍，做一个小而美的故事，做个小清新。 订座在团购前 如果我订座的同时可以享受团购的优惠，那团购的必要性就减少了，订座的关键在于与商家信息的同步。 那~在订座之前呢？外卖？ 如果回归吃的本质来说，我们每天都要吃饭，但是吃饱不再是目的，越来越多人希望吃好。但是对于外卖，从现有运输条件和技术条件来说，做不到可以吃得更好，海底捞外卖也仅仅是为了完善服务的闭环而已。外卖缺点也是相当明显，没有餐厅的服务，很多时候还是很难吃得爽的。对于烤肉，需要一分钟之内端上餐桌的，不论外卖怎么改善，都无法做到与在店吃的口味相同，现做的菜品也是比外卖好很多。所以，外卖更适合一些上班族，宅男宅女解决肚子饿的问题。 我要猜到你吃什么？ 如果我告诉你我今天的行程：学校——钟楼——小寨，假如你用地图搜索过相应的路线，如果会有这样的数据： 80%的人会在搜完学校——钟楼路线后，选择去钟楼饭店（地图数据+团购数据）。 60%的人会在钟楼附近搜钟楼饭店。 30%的人在去过钟楼饭店后，又来了第二次。 那么对于商家的数据分析（每天大概多少客户，回头率多少，在某地第一选择的饭店是什么，走这条路线最适合在哪些地方吃饭……）来给用户推荐好的商家，也是不错的。 套餐，让点菜更简单 很多用户不知道要点什么菜，如果由网友进行推荐套餐（搭配合理、价格适宜）会怎么样呢？ 比如这套餐适合3个人吃，这套餐适合5个人吃，大概多少钱，解决很多用户点菜问题。 吃货路线 定期举办吃货路线图（为什么是这几家店？这几家店背后有什么故事？有什么必点的菜？）完成路线后给一定奖励，当然，如果这几家店都是饺子店，那么对比出的优质评价就很明显了。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"大众点评","slug":"大众点评","permalink":"//www.zuohuadong/tags/大众点评/"},{"name":"餐饮","slug":"餐饮","permalink":"//www.zuohuadong/tags/餐饮/"}]},{"title":"对于苹果不能在中国首发的一些认识","date":"2014-09-28T02:22:47.000Z","path":"2014/09/28/pingguoshoufa/","text":"首先，影响力大小和是否审批关系不大，谷歌影响力也够大，谷歌nexus系列手机呢？ 苹果是否是因为审批原因不能在中国首发，不得而知，但有几点因素可以考虑。1.在国内首发可以定更高的售价来获取更多的利润。2.国内依然有着运营商的大额补贴。3.除非苹果跟日本香港代购公司勾结，否则完全没理由这么做。 排队问题，责不完全在苹果，黄牛排队给当地人买苹果手机也造成了麻烦，谁看见你会开心？当然，你说消费什么拉动当地经济增长，对不起，他们平民可不关心。就好比内地拉动香港房价，香港居民也是不开心的。 中国对于苹果手机，可以参考汽车刚进入中国的那个时候，大部分人还是用汽车炫耀的。 所以，理性对待苹果，对待手机吧。一部手机的钱能做的事情太多了～","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"苹果","slug":"苹果","permalink":"//www.zuohuadong/tags/苹果/"},{"name":"首发","slug":"首发","permalink":"//www.zuohuadong/tags/首发/"}]},{"title":"我的“白皮书”","date":"2014-07-05T17:57:18.000Z","path":"2014/07/06/me/","text":"有的人活了一辈子，却不如别人几个月的精彩。 历史篇，算是小时候的一些有趣的回忆， 历史篇（小时候） 生于一个月圆之夜，从我记事起，就一直和妈妈、外婆、外公在一起生活，外婆总是有着讲不完的故事，心灵手巧，剪纸、包粽子、腌酸菜……似乎外婆是无所不能的，可是外婆很少外出，身体很是不好，即使夏天也要戴着帽子，我一直不知道是为什么，一直以为是信奉耶稣。 那时候不知道为什么，外婆对外公不怎么好，总觉得外公很累，一直以来却也任劳任怨。我虽然也很同情外公，却也不能为他做什么。直到之后，听说外公之前把家里的钱都败光了，对外婆和孩子也不怎么好，那时候虽然不怎么理解，却怎么也没能把外公和那样的人联系到一起。 外婆每逢星期天都会去”教会“，我有时候也会跟着一起去，听着听着就睡着了，可是梦里可以梦到那个人在讲，有一次，外婆问我的时候，我给回答上来了，那时候这种叫”双皮脑“，只是早已没这特异功能了。 小姨后来在油田工作，每次回来都会带一些东西，那个时候家里并不富有，能吃一桶装康师傅面就很高兴了，当然也喜欢八宝粥。小姨比较严厉，但总归还是希望家里来人的。那时候据说，烧柴火突然旺，是火在“高兴”，家里最近会来人，于是，我为了看火是不是“高兴”，便经常帮家里烧柴火。 舅舅当时是在学修车，每次也总会带来一些小玩具，都是挺喜欢的，也跟舅舅最玩得来。那个时候总喜欢拆舅舅买回来的玩具，可拆了就装不上了，因此也经常被妈妈痛骂一顿。 家里冬天大多都在吃酸菜，那个时候还没有大棚，也只有过年的时候才会吃肉，童年吃过最好吃的东西，是在大勺子上炖了一勺肉。 夏天的时候，我们在河边玩耍，和稀泥，过家家，因为这还经常被家长催回家。整个夏天似乎都是在和水在玩耍，不论是捉鱼还是打水仗。 初秋，我们就开始摘杏，说实话，很多时候是在偷，我胆小，一直不敢上树，所以至今也没能学会。一直是在帮捡落在地上的杏，当然，杏还没有成熟，小时候大家都喜欢那种酸得软掉牙的感觉，所以杏很早就被我们摘光了，我一直也没有见过成熟的杏。那个时候特别喜欢在河边烤玉米吃，觉得特别好吃。 冬天，打雪仗，穿得和小鸡一样。当然，扫雪也是日常活动之一，那时候雪是能积很长时间的。所以几乎家家都在堆雪人。 傍晚的时候，外面总会响起“布谷、布谷”的声音，很是神奇，虽然一直很想出去看看究竟，但是一听说晚上有鬼，就吓得不敢出去了。 我听说母鸡不啄人的，于是一天，就把食指伸给正在孵小鸡的母鸡，结果真给我啄了一口，一层皮没了，疼得我直接哭了。其实那个时候很怕蛇，直到现在也是，有人说我大概是田鼠变的。 初五开始，每隔五天是这里的集市，那时候很多东西也都只能在集市上才能买到，妈妈也会带我来这里买一些东西，那时候，衣服都是哥哥穿完弟弟穿，一件衣服往往能来来回回倒好几个人的手中，妈妈总会带我来买菜或者买点小玩具什么的，而且一直以来都比较疼我，在我印象里，一直没有爸爸，后来我也在奇怪，却也只能得到”爸爸不在了”这样的答案，我并不知道的是父母在我满月的时候已经离婚了。 直到后来上学，经常和妈妈同时的孩子在一起玩，因为我最小，所以也老被欺负，因为这事也总是让妈妈操心。后来妈妈问我，为什么和别人打的时候总是不还手，我说了一句：“我既不希望别人被打伤，也不希望自己被打伤。”即使到现在也是一样，虽然我会还手。对于吃，现在几乎是不挑食，可那个时候还是比较挑食，不怎么喜欢吃面的，但是饿的时候还是会吃方便面，于是那个时候妈妈用电炉给我煮方便面依然记得。 第一次尝试着去上学的时候，那个时候算是班里最小的一个，因为实在是太淘气，被老师批了一顿，然后悻悻回家了。直到第二年才开始上学，（没有上幼儿园）是从学前班开始的，倒也是很贪玩，小霸王是那个时候的记忆，经常玩得忘了吃饭，然后被妈妈骂。后来流行打玻璃球，用纸叠各种各样的东西。 上学后，比较懒，所以有时候让妈妈帮代写作业，然后自己填答案，因为妈妈写的字实在是太漂亮了，所以数学老师一眼就发现了，我居然给说了句：“本来不让妈妈帮我写的，可妈妈非要帮我写。“惹出了不少笑话。 有一次，是妈妈生气了，用竹条打了我，结果打到脸上一条血印，后来去包扎了，留下了伤疤，当几乎是毁容了，却来也从来没有因为那事恨过她，买了去疤痕的药才见好。 心灵：小时候的印象是没有父亲的，所有家里人一直来也比较疼我，所以有时候感觉是被惯坏了，那个时候虽然家里不富裕，但是也从没觉得受苦，和同龄人比起来，我是个长不大的孩子，或许现在还有着那份童心，只是再也没有那般年纪了。 成长篇： 一直到8岁，我对别人说的话从来不怀疑的，比如你告诉我这件事是真的，我就从不怀疑，记得有谁骗了我，编造了个荒谬的理由我居然傻乎乎的相信了，那个时候正好有个学生喜欢看小说，就把小说里情节讲给我听，我信以为真了。因为，我总是觉得如果别人说不会骗我那就肯定不会骗我，直到后来有一天两个同学给了我两个完全不同的答案之后，我居然才傻乎乎的意识到，原来别人说的不一定是真的。 那个时候秋天，从山上往下跑，是没有路的，突然跌倒了，整个人从山上滚了下来，害怕极了，正巧，下面有块梯田，我滚到边上才算挺了下来，好在没有受伤，如果没那块梯田，估计就要挂了。 小时候其实比较骄傲的，做点什么事情总是高兴得不得了，也总是不愿意去承认自己的错误，思考问题的时候也总是比较个人的得失，所以即使是这样，很多同学也因为我妈当时给他们带过课，比较照顾我，现在想想也是比较感动的。 这问题后来到初中就开始显现出来了，当时和老师关系比较好，却和很多同学组成了对立面，直到后来我才逐渐意识到这个问题的严重性，我在努力改变自己，直到和最为反对我的同学做了朋友后，这问题才得以缓解。 15岁那年，是唯一一次和妈妈动手，也是最后悔的一次，虽然没造成什么伤害，不过自那以后开始渐渐懂事了，原来~自己欠老妈太多了。 所以到高中之后，我的人脉还算不错的，也算个愤青级别的爱国主义青年，那时候有个英语老师对我影响极为深刻，事情是这样的，在老师批改我的作业，我开玩笑说：”老师写的字也不怎么样。“结果老师很生气，当时说我：”管这个事情对我来说有什么意义？“，是啊，我一直在做的很多事情没有意义，我开始了自己的反思。后来有一节课上，一同学英语造句，大意是：”他被车撞了，可是没有人来救他。”，这个句子后来被老师改成了：“他被车撞了，后来有许多人来救他”，老师的解释是，虽然很现实，但是没能力去改变，那就不如接受好的“现实”，何必让自己心情不愉悦。可以说这两句话，在我后来是很受用的。 某年的2月15号，算是我人生第一次恋爱，当然学校还是不允许的，原以为一切就可以这样下去了，可是，一些磕磕绊绊总还是有的，同年10月，我被甩了，还是没想到这事情会发生在我身上，原本很多事情也都变得不习惯了，仿佛是个天昏地暗的日子。那个时候对感情的理解还处于生命属于感情的一部分，或许只有“心不动，则不痛”，因此想到很多种极端的方式来解决，直到后来用刀划向手腕，当然没挂掉。那时候，突然才懂得：这事情已经无法去挽回了，既然死都不怕，那还怕什么？虽然在随后的半年甚至一两年里还是没能走出那段阴影，但还是觉得应该认真去对待，将心比心。后来比较感动的一件事是，我说过我想学C语言，于是有个女生跑遍城里的几乎所有书店，买到一本C语言相关的书，和从一本杂志上撕下几页有关C语言的书，送给了我，这事我直到我后来才知道。当然，从内心来讲，我没办法保证一直只喜欢她，所以，我还是拒绝了，因为对我难以保证的事，我并不希望伤害到谁。 后来，几经奋斗，还是考入了这不怎么如意的大学，因为当时以为大学都是有湖，有图书馆的，结果发现到了一片荒地上。大学，埋藏着太多的幻想，自己也有一些缺点没能改正，比如：好面子和不怎么愿意承认错误。所以我一直在尽力克服，如果这些缺点还存在，那自己凭什么去做一个优秀产品经理。而且，当时一直在权衡做事情的价值，直到了一种极端，所以，很多时候，开会什么的，是尽量避免的，也因一直在考虑价值的问题，和很多朋友都失去了联系，几乎一年多的时间，我在做自己喜欢做的一些事情。放短假也是很少回的，因为来回车费200多，差不多够7天的伙食费了。直到有一天突然在想，自己和妈妈的见面机会还有多少？我才明白，很多事情是不能用价值来衡量的，或者说是远高于价值的，比如”关系“。所以后来一直在珍惜和每个人的关系，一直在和很多人说对不起。 这期间其实也是有着和别人短暂的感情的，当时有一段时间是很多事情在忙，所以相互冷淡了，结局是我不希望看到的，当时有一个问题是：”你该为一个人而改变自己，还是让对方适应你的生活？“”我愿意去改变自己，但如果有人愿意去适应我的生活，我还是会很感动并感恩的“。 后来明白一个问题是，做事情想着你的初衷，之前有一个哲理故事叫“砍树”，内容是这样的，老教授问：“如果你要上山去砍树，一颗粗，一颗细，你会砍哪一棵？”“当然粗的”，老教授接着说，粗的那棵是普通的杨树，细的是红松，那现在会砍哪一棵“”当然砍红松了“又问：”杨树笔直的，红松七扭八歪，又会砍哪一棵呢？”有人问，教授想告诉我们什么。教授回答：“你怎么不问问你为什么去砍树呢?如果取材必然杨树，如果工艺品必然红松。”还有一个例子是，武侠小说里，经常有为了救同伴，自己牺牲的，这个初衷是为了救同伴，那么同伴留下来送死就显得没有什么意义了。 心灵：成长伴随着无奈与伤感，我们不得不离开，那段日子却再也不能回来，有时候走得太快了，发现失去了好多。年轻的时候，有着冲动，感谢还有着那份纯真。 &nbsp; &nbsp; 感悟篇： 我不是什么“正人君子”，看过，但很少去看那种东西，因为我很怀疑虚拟的价值。 游戏，曾很疯狂地玩过，但是总体来说对网站的热爱还是高于游戏的，所以在使用电脑的大部分时间里很少会去玩游戏，尤其是有”正事”的时候，现在几乎不去玩了。 高富帅，除了高以外，其他字我几乎都不沾边，我很少买衣服，因为我很难找到在够穿的情况下，新衣服所带来的价值（当然你说可以少洗几次，我也没办法），甚至，很多情况下，我是很有魄力去步行或着骑自行车的，今年5月份，是我第一次进咖啡馆（还是因为活动兑换），我一直以来的观点是，咖啡不值那么多钱，其实后来才发现，值钱的是那种环境和氛围。因此，很多钱其实是花在自己喜欢的事物上的。还有一点是，我更加注重的是综合使用成本，一台8000的组装电脑，我用了有6个年头了，从来没坏过，而且配置仍然可以流畅运行很多大型程序，那我为什么要买4000的电脑3年一换呢。一部手机，要么满足我90%的需求和应用，那便宜就好，要么能满足我特殊的需求，有着惊艳的东西，花更多钱也好。 消费，我对消费的看待是，第一：计算综合使用成本。 比如买一双鞋能多穿两倍时间的，即使价钱贵一两倍也无所谓。家里买过一台电脑，组装花了7000多，可是用了快7年了，没出过什么问题，现在性能也算不错，跑个战地3什么的中高特效依然可以，那我为什么要花3000买个用3年性能就淘汰的电脑？使用成本上来说，不划算。 第二：要么实用，要么惊艳。 比如小米3和红米，小米3并没有什么惊艳的地方，那我就选择实用的红米。 第三：不为省小钱花大钱。 如果吃饭剩下，我一般会多吃一点，避免浪费。但是如果要吃得撑，我觉得就没必要了，既然是吃饭，吃饱就好，没必要损伤身体，搞不好还要付出医药费。 技术，我真的很瞎，这也不知是谁造谣的，很多技术方面的东西并不是我在做，可以认为我是翻译机，能把需求变成程序猿能听懂得话。我一直想做的是运营，对于技术方面，没有太多的天赋，也只能说爱好，但不精通。 裸婚，我比较赞同的是两个人之间其实最重要的是感情，但是结婚可能一个人一辈子只有这一次，可以不豪华，但总该风风光光过一回，裸婚就显得太儿戏了。 感恩，我觉得这是一个人最重要的品质，不论是对亲情，对感情，甚至是对敌人，没有谁是天生欠你的，也没有谁是有义务去帮你的，没有理由去记恨，当然，也要感恩帮助过你的人。如果懂得感恩，会有很多人不会去考虑分手。 珍惜，对于得到的东西，我们总是忘记去珍惜， 感情，两个人首先得是好朋友，高于友情，其实就是没有血缘关系的亲情。对于感情的看法，我觉得这是两个人的事情，可如果每次都是任何一方的单方面付出，这样两个人或许都很难幸福。 喜欢男生还是女生：之前说过的一句话，被讹传成“我不喜欢女生”，后来就变成了各种版本，“我喜欢男生”、“我是同性恋”等等，其实最早的一句话是：“我害怕女生哭“，其实还有后半句是：”尤其是看着自己喜欢的人流泪“。 生命的意义：我一直在思考，生命的意义在于什么，却发现考虑这个问题本身就没有什么意义。如果童年，你喜欢玩具，却没能买到，等到有一天长大，你买到了这个玩具，却再也没有那个心情去玩了。如果喜欢一个人，却没能表白，等到以后老了，想表白了，却再也找不到那种感觉了。那，在合适的时间做合适的事情，有些事是值得你去拼的，错过了却再也没有了。 对于自己的评价：一个热衷于理想的现实主义者。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"我","slug":"我","permalink":"//www.zuohuadong/tags/我/"},{"name":"白皮书","slug":"白皮书","permalink":"//www.zuohuadong/tags/白皮书/"}]},{"title":"剩余流量清零为什么合理","date":"2014-04-02T00:52:38.000Z","path":"2014/04/02/liuliangqingling/","text":"首先，要说明的是，我同意国内运营商资费过高的观点。那么，流量清零本身没有意义？ 其实现在运营商套餐就像带宽包月一样，不同的是限制你最大使用流量而已，其实按0.3元/M使用，就是运营商给的“不清零”套餐，即使我们把10元100M清零换成10元30M不清零也是没有意义的，别指望提高运营商成本还希望运营商不涨价的。一旦包流量不清零，那么一定会存在更便宜的包流量清零套餐。 不确定性增加运营商成本，终会消费者买单。 运营商建设基站需要应对流量高峰期带来的问题，如果流量不清零，就有可能将好几个月存下的流量在同一天使用(比如热门事件或者其他原因)。那么，便会增加运营商的不确定性，从而增加成本，进而导致的结果是流量资费过贵。流量不清零真有那么美好么？ 首先，如果运营商敢于流量不清零，就一定意味着它肯定可以提供更便宜的清零套餐。 1.大量的流量将积攒在高峰期使用，比如一年存下来的流量都可能在过年回家的火车上使用，甚至是拿来看电影。而以往不清零时，大家不会这么做的，这样结果就是，整体网络变差，运营商建更多信号塔，为此消费者也将付出更多成本。 2.合约机有大量的流量积累，他们回家看电视剧都是有可能的。整体成本升高，合约机剩余的大量流量不再纠结，到时候必然成为第一选择，运营商进而垄断手机行业都是有可能的。类似的服务器租用的流量如何计算？给大家举个类似例子，服务器如果按流量计，大概费用是0.3元/G，200元/1000G的样子，流量不清零，加上主机的60元/月费用。但是你要知道，按月租用下来是相当便宜的，120元一个月，包含主机以及2000G的流量，流量月底清零。服务商敢于给这么大流量的原因就在于，有相当一部分人并不会用尽流量，所以一定程度上降低了服务商成本，也不会因此增加服务商的不确定性。如果运营商流量不清零，你还用得起流量么？如果按照前面的例子，流量不清零，费用涨5-7倍的话，你还觉得流量清零是一件坏事么。其次流量清零和不清零其实是两种计费方式，国外也有类似的案例，至于流量转让，只能算作运营商增值服务来提高自己竞争力。追根到底，其实我们需要的是运营商降低资费，而不是跟运营商玩这种游戏，运营商间存在暴利，但不是靠这种文字游戏能打赢的，我们把更多注意力放在流量清零上面，却忽视了真正的资费问题。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"},{"name":"流量清零","slug":"流量清零","permalink":"//www.zuohuadong/tags/流量清零/"}]},{"title":"当夫妻关系不存在，我们将陷入怎样一个世界","date":"2014-03-31T09:25:32.000Z","path":"2014/03/31/fuqi/","text":"事出于最近，朋友圈、空间、微博等被各种刷屏，看了太多的评论，对文章~有支持，也有反对的。 在你心里，男女是平等的吗？ 如果不是，那么在你心里的这种关系其实是扭曲的，不论是大男人主义还是一味地付出，都很难得到好的结果，因为感情是两个人的事情。 考虑一个问题：当夫妻关系不存在，我们将会陷入怎样一个世界？ 这或许是相当可怕的，如果男方不再需要对这种关系负责，那么如果生孩子，大量的生活成本将由女方承担，再后面，造成的后果是不敢去想象的。 所以我们就应该能理解，为什么一代又一代的“妈妈说”来教导女儿去防范那些“坏男人”，而父亲却从来不会教自己的孩子如何泡妞。 那么，男女关系的本质是什么？ 是由友情转向亲情的中间关系，它比友情的关系更深，却不像亲情那样具有唯一性（你只能是一对父母的孩子），说白了，这更应该被称为一种关系而不是承诺。 我们还相信爱情么? 没有爱情就不会存在现在的血缘关系，而且即使是血缘关系，那些赡养问题也比比皆是，感情更需要是一种信仰（宗教一直存活至今的很重要的原因），对~对方的信仰。 再回过头来看文章事件： 首先，文章肯定错了，但这种是道德层面的错误，而不是法律层面的。 那么，换成是你，你真的会只喜欢一个人十年么？相当难，只喜欢一个人才不正常。也就是说，会喜欢上别的人，但是人又是有感情，有责任心的，你需要对这个家庭来负责。 对网上各种评论的一点说明： 生活中其实有很多“是男人就该这样”、“是女人就该这样”，如果你也尊重对方，那么，请不要用这样的话语来伤害对方，面子是可以互相给的，真挚的感情，也请不要拿来伤害。 文章事件的一点反思： 一段错误（出轨）的开始，一旦产生问题，那么，会将所有的事情归咎于这段错误（出轨）的开始。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"夫妻","slug":"夫妻","permalink":"//www.zuohuadong/tags/夫妻/"}]},{"title":"人生~时间去哪了","date":"2014-02-04T08:54:00.000Z","path":"2014/02/04/time/","text":"春晚舞台背景展示着网络名人大萌子的“30年父女合影”，30张照片凝聚30年父女情，引人深思，王铮亮同时倾情献唱《时间都去哪儿了》，“时间都去哪儿了？还没好好感受年轻就老了，生儿养女一辈子，满脑子都是孩子哭了笑了……” 首先，我们去追溯时间这件事本身就是没有意义的，我们感慨时间的流逝，就像感叹一去不复返的水流一样，事物发展的本性是无法去阻止的。 其次，我们为什么会发出这样的感慨？其一，是因为过去的时光美好，值得我们去怀念，向往小时候却再也无法回到过去。其二，小时候喜欢玩具，动漫，可你走到青年的时候，再心爱的玩具动漫，却再也没有了那种心情。青年的时候，喜欢某个心仪的女孩，可一直没敢表白，当你走到中年的时候，即使有了那份冲动，也没有了那份心情。终于走到中年了，可惜生生错过了人生的一次机会，当你走到老年的时候，却再也有心无力了。 其实，人生就是这个样子，当你留恋的时候，却再也回不到过去；当你悔恨的时候，却再也没有了那份心情；当你懂得这一切都很宝贵的时候，却已经觉得太迟了。 时间，不断在流逝，我们追寻时间的足迹已然失去了意义，在适合的时间做适合的事情，如果小时候没有了好奇和贪玩，年轻的时候没有了冲动，那到了年老就真的只有后悔了。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"人生","slug":"人生","permalink":"//www.zuohuadong/tags/人生/"},{"name":"时间","slug":"时间","permalink":"//www.zuohuadong/tags/时间/"}]},{"title":"人生～永远没有标准答案","date":"2014-01-31T18:29:30.000Z","path":"2014/02/01/rensheng/","text":"小时候，老师问我们：弯弯的月亮像什么？答：小船。我们似乎已经习惯了这种标准答案，结果是习惯了接受和寻找这种标准答案。有个路人问：你知道去长安的路怎么走吗？那人回答：知道。很多时候，我们追寻问题，却发现自己想要的并不是结果。每个人都知道自己的结果是死，却依旧想着痛痛快快过日子，有的人奋斗，有的人机关算尽，有的人整日无所事事，却也有的人花天酒地……我们所追寻的真的是一个结果，一个标准答案吗？就像魔术，我们总是好奇于真相，却在看到真相的时候失去了对魔术的兴趣，我们是在找真相么？不，只是在探索真相的过程中，我们得到了乐趣。那，如果知道答案，你还会再选择它吗？就像柯腾没有选择让沈佳宜给他答案一样，也许，答案他早就知道，也许，他永远不知道。而沈佳宜也没有选择告诉柯腾自己的心里话。或许，正因为没有答案的包袱，两个人才无拘无束，但不论如何，属于两个人的那部分，永远留在了最美好的时候。人生，或许就是这样，我们永远不必知道真相，怀着那份期盼和向往，标准答案，就当作是永恒的秘密吧。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"人生","slug":"人生","permalink":"//www.zuohuadong/tags/人生/"},{"name":"标准答案","slug":"标准答案","permalink":"//www.zuohuadong/tags/标准答案/"}]},{"title":"驳“适合自己才是最好的","date":"2013-10-03T06:59:22.000Z","path":"2013/10/03/shihezuihao/","text":"首先，这句话本身是值得怀疑的，“适合”的方案可能有多种，但是“最好”就只有一种了。撇开这句话本身的问题不谈，“适合”是一个很笼统的状态，究竟怎么算是适合？如果是适合自己本身的话，我觉得这句话就有待斟酌了。我们对待事情应该量力而行，但不意味着量力而行就一定是最好的。比如对于一个庞大的狼群，最适合的食物莫过于羊，但如果羊的数量十分稀少该怎么办？如果还去捕羊的话，可能的结果是大家都饿死。所以适合自己的前提一定是适合自己所在的环境，每一次科学技术的变革，其实都得感谢那些顺应环境的人，如果每个人都在追寻适合自己的生产方式，估计也就不会有像今天的文明。如果每个人都安于现状，估计也就不会有今天的成功。所以，首先适合环境，其次适合自己才是最好的……","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"适合","slug":"适合","permalink":"//www.zuohuadong/tags/适合/"}]},{"title":"驳“存在即合理”","date":"2013-10-03T04:28:34.000Z","path":"2013/10/03/debudaozuihao/","text":"“存在即合理”这句话本意是事物存在是合乎它本身的理性。也就是说这个“合理”的意思是合乎绝对理性或绝对精神，并不是我们语义上的合乎人伦道理。那么将它解释为合乎道理，有什么错误的地方呢？举个例子，有某种动物即将灭绝，或者有一种社会现象即将被抹杀，那么用这句话是显然解释不通的。同理，犯罪行为存在，法律也存在，如果两个都合乎道理，那么法律为什么要制裁犯罪行为呢？所以“存在即合理”这句话当做合乎道理明显是解释不通的，所以只能说合乎事物存在它本身的理性。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"}]},{"title":"有关B2C/C2C购物网站“导购台”的想法","date":"2013-08-19T11:36:26.000Z","path":"2013/08/19/daogoutai/","text":"经常有些顾客网上购物不知道如何才能搜索到自己想要的商品，而通过分类浏览又比较繁琐，即使搜索到商品，也一时之间难以找到符合自己要求的商品。 “导购台”是通过一个可以由顾客自由发言的平台，顾客可以说出自己对商品的需求？ 比如： 1.有没有价位在3000左右的正品白色iphone4？（条件较多的搜索） 2.有没有多个导向轮自由旋转的适合旅行用的箱子？（用户对“万向轮”等商品关键词不清楚） 3.有没有西安南郊售A4某品牌打印纸的。（搜索条件较为苛刻的） 系统会通过关键词判断，来将此信息推送给符合要求的一些商家，这些商家根据具体情况可以选择与顾客进行交流，从而主动达成买卖交易。 对于买家来说，不需要花费过多的时间就能搜寻到与自己心意相合的商品，对于买家来说是一种更快速便捷的购物体验，同时也能引导一些不熟悉网购的人促成交易，这样大大提高了商品的交易量。 对于卖家来说，需要多多留心，将精力放在服务顾客上，而不是过度装饰店铺，同时也减少了刷销量的行为。 但是，对于新事物的出现，总会有一些人喜欢发广告什么的，这就需要网站有一个良好的消息鉴别机制了。 由于个人时间与精力关系，对此问题不再深究，只希望给大家能提供一些新的思路。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"}]},{"title":"暴风看电影分析及建议","date":"2013-05-05T14:58:32.000Z","path":"2013/05/05/baofengdianying/","text":"本来是给暴风的东西，今天我直接放出来吧，也希望播放器行业有些改变吧。 首先，作为一款聚合电影的产品，我觉得暴风看电影安装界面、桌面图标、整体UI的设计都是蛮不错的，但是也有一些不可忽视的问题。 我先从功能上来讲吧： 从发展上来看：如果在线视频是一家独大的局面，暴风看电影还是会和“聚合搜索引擎”一样，无法撼动“百度”的位置。 作为一款在线看电影的软件，其实很多人都在关注：全、快、清。 全：影视资源够不够多，是否有最新的电影？ 暴风目前聚合24家影视资源，影视资源应该够多了，但是也有两个问题不容忽视： 1.在一些P2P播放器以及一些P2P下载站上可以得到比这24家影视更新甚至更多的影视资源。 2.各大视频网站的VIP模式，将会限制到暴风看电影的资源。 快：能否即点即播，看视频不卡？能否快速找到我想看的视频？ 1.受制于各大视频网站，一些视频网站为了推出自己的播放器，也会对在线观看进行一些带宽限制，由此暴风看电影还面临着各大视频网站自己播放器的竞争。 2.暴风看电影是聚合模式，在搜索电影上依旧存在不可避免的缺陷。 清：视频是否清晰？音效是否震撼？ 1.暴风推出了金左眼，但是用户习惯性的双击“全屏”还是会导致金左眼失效。 随着H.265视频编码的商业化，应该很快就会实现1M带宽播放720p高清了， 2.对于音效方面的增强，已经在暴风影音上有了，我们依旧期待中…… 从用户体验上来说，还是可圈可点的，这里我说一下不足吧。 1.因为直接在线播放，双击全屏/ESC退出 与“金左眼”会有冲突，这里能否考虑下先下载到本地，然后再播放的方式？ 2.找视频的方式较为单一，还是传统的分类+搜索。 我眼中的暴风看电影： 1.平台化 本地播放插件“暴风影音”实现对本地视频进行播放的功能。 P2P插件实现对“暴风资源服务器”发布的视频进行播放。 转码插件“暴风转码”实现对视频进行转码。 视频下载插件“硕鼠”实现对视频的下载。 字幕插件，实现播放视频时自动下载字幕。 手机管理插件，实现手机电影和电脑电影的同步。 更多由开发者进行开发的插件…… 2.社交化 即时评论：边看边评论影视，还能查看他人的评论哦。 暴风分享：一键分享自己所看的视频给好友，并且可以粘贴在QQ、人人上…… 大家在看：可以查看好友最近观看的视频和评论。 3.数据化 通过对用户观看数据进行统一分析。 精准广告：基于用户数据分析的精准广告推送。 猜你喜欢：根据历史记录，通过算法对用户的爱好进行分析并推送。 数据平台：将数据开放给第三方合作平台，并且可以用于开发应用中。 如：1.通过分析影片关注的增幅，可以提前预测关注度。 2.年龄段分析可以得到不同人群对影片的关注。 更多应用…… 4.正版化（依据政策） 随着国内一些视频网站的相互竞争，正版影片的准入门槛也越来越高，内容收费的春天虽然还没有到来，但内容收费会逐渐成为趋势。 如果暴风占有60%的桌面市场，那么暴风便有了和视频网站谈的资本了，通过暴风不仅可以降低这些视频网站的运营成本，还能提高用户体验，同时收费起来也更方便。 【写完此文，本来还是应该有个市场建立与分析的，可惜我写不下去】","tags":[{"name":"暴风看电影","slug":"暴风看电影","permalink":"//www.zuohuadong/tags/暴风看电影/"},{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"}]},{"title":"浅谈BBS未来发展模式，BBS如何革新","date":"2012-12-24T12:50:47.000Z","path":"2012/12/24/qiantanbbs/","text":"BBS是社会化产生内容的网站，而它本身的这个特性，一方面能产生大量的内容，一方面也产生了很多水化的、没用的内容，导致可读性、内容价值越来越低。 现在人们的时间宝贵，对信息精准、有用的要求越来越高，所以BBS必须要解决这个信息问题，一个是内容的质量，二是索取方便！ 这样才能提升BBS的可用性和价值。BBS的弊端是明显的，而至今仍未能彻底解决这个问题，反观微博，有价值的信息得以传播，因此微博火了。 但微博只是暂时的，SNS才是永久的： SNS网站带来了前所未有的大交往平台，它使得人们以往彼此独立的各不同类型的社交圈产生了融合，消弭了各人际圈之间的界线，由此可能会带来交际的尴尬。戈夫曼曾提出情境决定论，认为人依据不同情境做出行为决策，而情境是分割、独立出来的。每个人都会依据不同的社交圈(情境)决定自我展露和社会渗透的程度，人都会对某些人保留一些秘密，而对另外一些人敞开心扉。但SNS网站却带来了梅洛维茨所说的“地域消失”效果，或会使人们失去言行前提，让人感到无所适从，这可能对现实的人际交往造成麻烦。也许有一天你突然发现你的老公竟和自己的初恋男友联系上了，并且知道了许多你以前的事情，而这些是你不想让其知道的，有可能会给你带来意想不到的烦恼，那么此后你在社会化媒体上的行为一定会有所拘束。SNS网站在某些方面并不契合中国人含蓄的民族心理和内敛的民族性格，为了避免越界尴尬，一些人只得放弃使用。这一点也可从短信息在中国十分受欢迎上得到佐证。 同样，SNS存在的问题不可忽略： 当代中国人处于两难之中，人们渴望与他人情感交互，但又觉得这样做太浪费时间无益发展，现代人是孤寂的“罐头人”。人有沟通的需求，需要向外界表达和释放，但是由于时间有限、交际面狭窄、忙于生存发展，人们每天和他人交流的时间极少，所以经常出现人的自我传播，自言自语，包括独自哼曲唱歌。现代社会竞争激烈，人们的生存状态普遍不佳，凡有进取心的人大都忙着奋斗，于是很少舍得花时间与人沟通。就算有交流，也很少有人愿意花时间去说一些对现实发展“无用”而被认为是“废话”的话，沟通主要以工具性为主，而SNS基本上属于闲聊性质。通过以上问题，我们大概可以了解到：1.BBS改革是必然的。 2.SNS在国内仍有发展潜力，但是内容“无聊”。 BBS+SNS的模式（即：内容+互动）会成为BBS发展的一个新方向。 内容寻找用户： 一般在BBS我们需要花很多时间去寻找自己真正需要的内容，而新BBS要实现的则是内容去寻找用户，这点可以通过SNS化来解决。 我们注意到在9.0关注用户的前提有两点：第一是某人发布的内容精彩，第二是这个用户你认识。 但是无论基于哪种关注，对方发布的信息内容基本是符合你口味的（实现了内容寻找用户） 互动性： SNS在互动性方面有着BBS难以比拟的优势，同样的用户，在SNS可以更简单地去对自己喜欢的内容进行评论，还可以对喜欢的内容进行分享，达到优质内容通过用户得以传播，而不是通过置顶主题、顶贴。 多样性： 传统BBS只能将帖子的标题展示出来，而需要查看详细内容则需要继续点击。SNS可以将图片、音乐、文字直观地展示出来，增强了用户体验，也提高了用户互动。 “无聊&quot;性： 也有相当一部分用户是无目的去逛论坛的，贴吧的方式使得这些无聊用户第一眼就看到自己喜欢的内容，这点在phpwind9.0中得以佐证。而SNS的无聊性甚至要比贴吧还高，因为除了无聊之余，看别人发的帖子，你还可以去和一些人”交友“，如果有聊得来的人，这个用户会直接从偶尔看看变为常客。 当然还有一些其他的，我不再一一列出…… 然后，我再要说明的是之后的扩展，也就是完成BBS+SNS这一步之后的事情，恐怕大家最关注的应该是”盈利“，网站做到一定程度后，盈利是避不开的问题，而融合电商会是一个好的出路。众所周知的原因，PW整合电商是相当容易的。 BBS+SNS+电商的模式（即：内容+互动+盈利）或许是BBS的最终出路。 有人反问我，淘宝SNS都尚未成功，我们这些站长何谈成功呢？ 淘宝的SNS化不成功是它没有基础，也就是没有SNS发展的基础： 第一点：好友（淘宝上的好友几乎都是卖家与买家的关系，这样不认识的人分享东西，你会仔细去看么？何况卖家经常会分享一些自己的东西） &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;第二点：互动（90%以上都是买了某某商品，获得了某某勋章，这样的内容你让用户怎么互动）第三点：核心（用户来淘宝购买一件商品，几乎是不需要去看买家中心的，顺便说一句，连首页都不敢SNS化，何谈要SNS？）而BBS+SNS 改革后，是有融合电商的基础的。试想，你看到朋友买了什么东西，会不会去评价？（人人网上发个吃货图片也会有人评价的）所以只要做好前两点的融合，再去融合电商是没有什么大问题的。 好了，我话先说到这，我推崇的模式是：BBS+SNS+电商 各位站长们可以参考，不喜勿喷，这并不是适合所有站长。","tags":[{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"},{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"BBS","slug":"BBS","permalink":"//www.zuohuadong/tags/BBS/"},{"name":"论坛","slug":"论坛","permalink":"//www.zuohuadong/tags/论坛/"}]},{"title":"浅谈淘宝SNS化","date":"2012-12-19T09:56:57.000Z","path":"2012/12/19/taobaosns/","text":"蘑菇街、美丽说……似乎预示着电商的SNS模式即将崛起，作为电商的老大哥淘宝也尝试着SNS话，可惜并不是那么顺利。 &nbsp;&nbsp;&nbsp;&nbsp;淘宝在各个入口都设置了“分享到淘江湖”，可谓用心良苦，而且改版的个人中心也让大家觉得淘宝SNS化的决心。 &nbsp;&nbsp;但是，我们却忘了最重要的三点： 第一点：好友（淘宝上的好友几乎都是卖家与买家的关系，这样不认识的人分享东西，你会仔细去看么？何况卖家经常会分享一些自己的东西） 第二点：互动（90%以上都是买了某某商品，获得了某某勋章，这样的内容你让用户怎么互动） 第三点：核心（用户来淘宝购买一件商品，几乎是不需要去看买家中心的，顺便说一句，连首页都不敢SNS化，何谈要SNS？）&nbsp; 好了，说完这么多，说说怎么去解决吧。 第一：应该使用一套新的用户好友机制，最起码先得加上我认识的人吧（可能认识的人）。 第二：不要强制用户去分享，而是促进用户去发一些可以互动的东西，用户主动去发的。比如：“今天淘了个东西，可惜没过两天就坏了。”“今天真累啊” 第三：改首页，没必要去大规模去改，最起码的，可以看到“大家都在买什么”。在商品列表页可以滚动显示“买家的评价或者是有关的微博信息”来决定自己是否要买吧。 &nbsp; 说完这么多，虽不能完全概括淘宝改革的问题，但是其中一些问题我觉得还是有必要去深思的。电商和SNS是一个很复杂的东西，淘宝SNS化可能问题最多的就是卖家作弊的问题了，这个很难有好的解决办法。总之，现在的淘宝做得不错。 谈得比较浅，也只是一时兴起写的，喜欢做深入研究的童鞋就没必要喷水了。","tags":[{"name":"淘宝","slug":"淘宝","permalink":"//www.zuohuadong/tags/淘宝/"},{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"},{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"SNS","slug":"SNS","permalink":"//www.zuohuadong/tags/SNS/"}]},{"title":"VPN“如何成为用户的云","date":"2012-12-12T12:11:14.000Z","path":"2012/12/12/vpnyun/","text":"对于VPN，相信大家都不陌生。终端用户网络加速最普遍的一种方式。 下面开始说一下我的想法（本文章属原创，转载请注明出处http://www.zuohuadong.cn） 前段时间各种免费CDN崛起，比如：安全宝、加速乐、360网站卫士。 这些服务面对的是个人站长以及企业，盈利模式尚不成熟。那么，直接将服务面向用户是不是也是一种出路？&nbsp; 设想一：IDC类服务 我先做一个设想，如果一个IDC企业的线路可以使一半以上的用户都可以高速访问你的服务（访问速度相当于集群），剩下的用户访问速度类似于访问多线。那么，如果你是站长，会不会考虑将网站托管到这里？如果你是游戏运营商，那么只需要部署一台单线服务器就能实现多线的速度。其他案例就不一一列举了。 设想二：用户云 很多东西只是在盗用”云“的概念，但是，设想一下：如果用户登陆每个网站都不需要账号和密码，系统能自动根据终端所安装的软件确定用户身份并通过接口与网站对接。 如果这都不算什么，那么当用户访问你网站的时候，无需登录你就会知道谁是新顾客，谁是老顾客，提供不同的服务。并且还可以根据客户习惯100%准确度推送精确广告。 &nbsp; 设想三：电脑云（扩展） 随着带宽的增大，那么很老的电脑，只要安装对应的终端软件，（这里也可以使用基于硬件定制的新主机，价格很低）就可以把自己电脑变成一台云电脑，即：主机只负责接收和解压显示信息，显示器用于显示信息，而数据处理将真正地放在”云“上。 &nbsp; ……（想了解更多信息？期待和您的探讨。） 而这一切，却都能依靠”网络加速“（VPN）软件实现，当这个软件免费的时候，当很多用户都乐意使用免费网络加速的时候，你便拥有了“云”的用户基础。史无前例地，改变这一切…… 【以上内容未经实践，如有不足欢迎指出】","tags":[{"name":"商业","slug":"商业","permalink":"//www.zuohuadong/tags/商业/"},{"name":"VPN","slug":"VPN","permalink":"//www.zuohuadong/tags/VPN/"}]},{"title":"Discuz手机客户端之论","date":"2012-08-08T19:22:34.000Z","path":"2012/08/09/discuzapp/","text":"前言：Discuz 推出手机客户端，大家在惊喜的同时不禁要问，Discuz 这是在做手机客户端还是做论坛收藏工具？ 对此我从Discuz团队思想以及问题由来为大家全面剖析【Discuz 客户端之谜】 PW手机客户端： DZ手机客户端 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;移动互联产业的强势发展促使一大批互联网企业争先恐后开发移动系列产品，Discuz 也不例外，开发了手机客户端。也可能是DZ最近一直向PW 学习，没有充分调研市场的原因，在我看来，Discuz 手机客户端存在严重的定位错误，这与之前的腾讯模式有着密切的关系。或许它应该叫论坛收藏工具。 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;之前，腾讯依靠QQ用户大规模向外扩展，屡屡成功，长期的良好发展使得腾讯认为用户都是为了活跃。这次腾讯模式在Discuz 手机客户端表现的淋淋尽致。 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;传统的腾讯模式使得腾讯仅仅是模仿产品，用户在 空间、朋友、微博执行着相似甚至相同的操作，这点也同样在手机QQ、手机QQ空间、微信中得到了很好的验证。这种模式使得腾讯稳固了自己的帝国，却使用户疲劳于这种重复性操作，之前QQ用户在线数量的下降也许说明用户已经开始疲劳了。现在这种悲剧同样在Discuz 手机客户端上演了，按照Discuz 的预想：当用户使用多个论坛时只需下载一个客户端便可以在多个论坛登陆。同时，手机用户使用客户端以后也会收藏十个论坛，并且每天签到十次，去每个论坛查看新帖、发表心情，用户如此重复着无味重复的工作，这就是DZ的用户体验？ &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;也许这还不具备说服力，那么请问DZ是给自己做论坛收藏工具还是给站长做手机客户端？如果真的是论坛收藏工具，那么请设置一次签到所有论坛，并且将帐号统一化，毕竟目前DZ还不能说是给站长做客户端。如果真的是后者，那么每个论坛都有自己的活跃用户，安装客户端也一般只是这些人，换句话说，一般每个用户所需的论坛客户端不会超过3个，手机客户端这种收藏功能也就相当没有必要了，作为一个手机客户端本身就应该个性化差异化来吸引人，phpwind可定制客户端就相当不错，可惜在易用性和服务上差很多。 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;请Discuz 开发团队记住，手机客户端不是用来推广论坛，引来流量的，更不是为了让用户去活跃这个产品，请Discuz 在做产品之前最好知道自己做的是什么，作为一个大公司的产品重点应该放在用户体验上面去。 &nbsp;&nbsp;&nbsp; &nbsp;&nbsp;望Discuz 好自为之…… 【千字文章，纯手打，希望大家顶帖】 &nbsp; 引用回复：其实我觉得康盛将客户端做成是收藏工具，是为了让用户得到更便捷的体验，他们只需一个客户端便可随意浏览众多论坛，而不用为了多个论坛下载多个客户端，不用退出这个再登陆那个，他们认为这是方便了用户，但是却结结实实地给站长带来了苦恼。首先，用户不可能会没事登陆登陆这个论坛再登登那个论坛，论坛不是微博，不是为了无聊，他们登陆论坛，往往是因为需要，或是下载资源，或是解决问题，或是偶尔灌灌水，所以用户并不会经常在各各收藏的站点之间切换，更不会用手机经常去访问对自己粘性仅仅积存于需要性的论坛，所以，他们的客户端走位是比较失败的。每个站长都需要自己的独特气息，希望靠自己的魅力去结结实实黏住自己的用户。语言组织能力不够，所以可能我写出来的和我想表达的不太相同，但很大程度上我很赞同楼主的观点，这就是我想说的。 &nbsp; &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Discuz 一直在定位错误，一直在学phpwind ，我觉得Discuz 彻底成为当年的腾讯了……这是传说中的默契还是两个公司在融合以后，统一文化的表现方式？我想，如果PW 能做好服务，DZ也就离末日不远了……但这恰恰不是我想看到的","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"discuz","slug":"discuz","permalink":"//www.zuohuadong/tags/discuz/"}]}]