[{"title":"我的第一篇文章","date":"2016-12-13T17:04:48.000Z","path":"2016/12/14/my-new-post/","text":"终于搭建好了一直想做一个博客来着，无奈自己太折腾，对访问速度各种要求，最后就直接用html做博客了。所以使用了hexo，就是现在看到的这个样子。github在国内需要佛跳墙才能访问，于是借助了百度云加速，这样就不用梯子了。","tags":[{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"第一篇","slug":"第一篇","permalink":"//www.zuohuadong/tags/第一篇/"}]},{"title":"69800、XV梦幻之旅为什么是传销？","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/69800xv/","text":"现在传销已经不不再需要限制你人身自由了，有些人可能不理解，为什么现在还有人信传销，那请你继续看下去。 案例一：69800项目 拿69800来说，只要缴纳69800，一周后返还19800，而且声称是为了造千万富翁的计划，能赚到1040万。还有个像模像样的项目策划书，好几页。 他们有这些理由证明： 1.所有钱是通过银行转账，如果不是国家允许，银行不会怀疑这笔钱么？ 实在是很牵强，有很多非法交易，通过银行卡转账就能证明它是真的？先查查对方用了多少张银行卡吧。 2.一星期返回19800作为生活费用，如果不是国家，谁帮你考虑那么多？如果是传销，钱还会给你么？ 这就是这种传销的高明之处，让你相信，然后拉更多人进来。费用打个折扣就是真的了？那还有50000呢。 3.所有收入都要纳税，国家规定纳税的项目都是合法的。 且不说洗钱也是通过交税来洗白的，这个项目有纳税的证据么？发票拿出来看看。 4.这个项目是保密的，目的是让一部分人先富起来。 怎么就选上你了，还能让你亲戚朋友进来，这一部分人也太广泛了吧。 5.这个项目运行很多年了，但是从来没出事情，如果不合法，国家会让这个项目存在那么长时间？ 黄赌毒也存在了很长时间，何况是各种骗术呢。 6.上面会发一张联通电话卡，入网无限扩张，而且号码没有4，暗示项目“没事”，如果不是国家支持，怎么能无限扩充？ 没“4”的号码花钱还是可以买到的，谁能证明那是无限集团网，集团网本身还是可以花钱搞的。 7.做生意的人，每天都电话联系，国家监控电话聊天，如果违法，我们早被活捉。 那电话诈骗怎么没被监控？ 8.所谓活捉，是被当地ZF为了某种原因，请我们扮演被活捉，捉完马上就放了。而且网上负面信息也是国家暗中发的，为了宏观调控，不让更多人加入。 厉害了啊，word哥，这都能编，你咋不说印尼海啸是宏观调控呢？ 9.各种网上的截图改改，甚至不改，直接拿来说什么政府宏观调控了。 天啊哥哥，给你个天气预报图，你是不是都能说成老天爷发怒了。 案例二：WV梦幻之旅 十八线公司&nbsp;在亚洲都没有分支机构&nbsp;根本都是忽悠！ 这个公司在国内根本没有合法经营权，而且入会就是教2400，什么都没有&nbsp;就是可以推荐，在美国入会2400的好处是你可以选择他们的旅游项目&nbsp;会非常便宜，因为除了入会费每个月你都需要缴纳大概300元会费，可是不是所有人每个月都会旅游&nbsp;于是这家公司就是拿其他人的入会费和会费去支付帐单，而且问题也来了，6个会员一共入会费是14400元，奖励200美金以6汇率计算，1200元&nbsp;每月570X6=3420，如果我找的6个朋友&nbsp;他们从来都不推荐&nbsp;我就只要当消费者就好了，每月我也缴300元会费，6X300=1800元，但是你每月却会有3420的收入 3420-1800=1620的缺口。这1620当然是公司来支付&nbsp;但世界上没有平白变出来的财富&nbsp;这1620当然就是他们之前14400的入会费来支付给你&nbsp;所以14400／1620 大约可以支付你9个月，9个月之后都没有新的团队发展&nbsp;可是你依然每月领取3420的报酬&nbsp;。那最后当然就是开始用别人的入会费和会费去支付。这就是拿后加入人的钱去支付先加入的人报酬的模式，这是典型的旁氏骗局方法&nbsp;！ 但是他比旁氏骗局好的地方是，他的确有一套非常非常实惠又棒的旅游福利给消费者选择，他们之所以能以比其他传统旅行社提供价格更优惠和更豪华的旅行项目的原因也正是因为他们除了支付经营者的帐单，也会拿出很大一部分来去支撑会员旅游项目的优惠.通过这样的方式以及大量会员团购的模式与知名的旅游票务网站合作，的确能提供非常棒的旅游套餐。 但是他们正因为通过这样的方法刺激大众，让他们不断分享这个又可以优惠旅游又可以赚钱的好项目，不断的拉拢后来进入的会员的费用来填补前面的缺，也就是说如果这家公司即便发展到了年营业额100亿美元的规模，只要公司开始变得只有消费者而没有经营者产生，那么只要9个月时间&nbsp;就会出现大面积的崩盘和坏帐。 因为很多之前加入的经营者在不断领取已经在该公司不存在的利润，哪一家正常的公司拥有大量的消费者每月不断循环缴纳月费的还会倒闭的？当然我们完全可以假设不断的会有经营者加入，但这家公司这种双轨制的模式本身就是极度不健康的.有非常大的隐患。 像这种WV好像一夜之间就火了，但经验告诉我，物极必反，来也匆匆去也匆匆[抠鼻]根本没有人会天天旅游，全部是冲着拉人头去的。别让自己一时糊涂钱没赚多少直接进监狱！ 也是什么创始人参加慈善基金会了，跟哪个大明星，政府官员握手了，什么携程出了一份问卷调查，结果大家都选MV梦幻之旅啦。 骗子捐款就是好人了？&nbsp;粉丝跟明星握手就是好人了？&nbsp;携程出的问卷你有没有仔细看，总共才500多人答卷，况且根本就不是携程官方出的问卷，你好好对比下。 都是什么神逻辑，要是有新闻报道，XX地球人拾金不昧，那全地球人都是好人了？ 美国总统喜欢旅游，是不是就可以拿来证明NV梦幻之旅是真的？&nbsp;求你们骗人用点心好么。 最后还是说：请多查查知乎。 之前文章由于lofter限制，未能发出，谢谢支持。","tags":[{"name":"XV梦幻之旅","slug":"XV梦幻之旅","permalink":"//www.zuohuadong/tags/XV梦幻之旅/"},{"name":"69800","slug":"69800","permalink":"//www.zuohuadong/tags/69800/"},{"name":"传销","slug":"传销","permalink":"//www.zuohuadong/tags/传销/"},{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"}]},{"title":"关于生成唯一加密二维码的方案","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/ercode/","text":"作为一个产品君，其实写这种东西心里是没底的。 事情起因是这样，因为项目需求，技术那边需要写一套算法，生成唯一的二维码，用户扫描二维码获得积分，而且只能使用一次。 ——————–如果你想知道最终结果，请直接拉到文章末尾—————- 然后技术用了php7的随机算法，加上哈希和时间戳的，但是有一个很重要的问题是：如果在1ms内生成多个，由于随机算法的原因，有可能出现重复。 最近刚好在看rsa算法，于是想到了通过rsa算法来加密，当然，为了生成的二维码具有可辨识度，使用了不怎么安全的512位算法。 而且为了不跟url冲突，需要对加密后的字符串进行urlcode编码，这样大概的长度是95位。 所以这个方案一的执行结果是： 第一步：生成唯一ID并制定好规则 商品ID（4位）+8位纯数字（唯一）&nbsp;【生成的时候使用sqlite3 数据库进行自增，以保证生成的字符串唯一】 第二步：使用公钥加密并且转化成urlcode编码 第三步：生成网址二维码。 http://aaa.com/code/这里是urlcode编码 第四步：服务端使用私钥解密，并且验证是否符合第一步的规则。 并且在数据库里做记录，防止重复验证。 （这里可以设定失效日期，减少数据库的占用和改善查询性能。定期做清理。数据库使用postgresql，查询性能会比mysql好一些） 方案的好处当然是拥有一对密钥，即使丢失一个，影响也不是很大。 问题也存在：第一就是RSA加密解密性能问题，第二就是数据库查询问题。 这两个基本上决定了性能不可能快。 于是想到了直接用hash值加密，全部存在数据库中，但是这样的话需要一行行比对，而且在字符串比较长的情况下，很耗费时间。能不能有一个明文的ID进行索引呢？ 后来突然想到网站的用户名密码方案。 这里先说一下网站用户名密码的加密方案。 密码先通过JS的hash加密，传送给服务端，服务端再进行一次加密，然后比对数据库里面的已加密值，由于整个过程中是密文传输（数据库里也只存储密文），且hash是不可逆的。所以是很安全的算法。 那么现在将用户名看作是唯一ID，密码hash的值看作是密钥，由于hash是不可逆的，所以不存在解密的可能性。 那现在的方案是： 第一步：确定唯一的二维码ID（明文） 商品ID（4位）+8位纯数字（唯一）&nbsp;【生成的时候使用sqlite3 数据库进行自增，以保证生成的字符串唯一】 第二步：随机生成一个哈希值（当然这个要存在数据库里了） 第三步：生成二维码 http://aaa.com/code/123412345678/这里是哈希值&amp;nbsp; 1234是商品ID，12345678是唯一ID。 第四步：验证，以ID为索引，查找对应的值是否正确。 当然注意，验证过的可以删掉或者标记为已使用。 上述商品ID和8位数字要占用掉12位，而且看起来也不是很安全，那么我们可以通过这个工具，进行加密的同时，缩短它的位数：http://hashids.org/php/ 1234,12345678&nbsp;可以缩成：ekNs4zWJM&nbsp;&nbsp;（9位加密字符串） 当然，其实也可以不用到hash，直接用PHP随机算法生成。 具体可以查看：http://www.zuohuadong.cn/2016/11/22/php_rand/","tags":[{"name":"二维码","slug":"二维码","permalink":"//www.zuohuadong/tags/二维码/"},{"name":"PHP","slug":"PHP","permalink":"//www.zuohuadong/tags/PHP/"},{"name":"加密","slug":"加密","permalink":"//www.zuohuadong/tags/加密/"},{"name":"技术","slug":"技术","permalink":"//www.zuohuadong/tags/技术/"}]},{"title":"PHP生成更好的随机数","date":"2016-11-22T14:20:27.000Z","path":"2016/11/22/php_rand/","text":"PHP不论是mt_rand 还是rand函数，都太差了，下面我用一张图证明： 一个比较简单的方法，用随机数填充一个位图，下面是一个填充黑白图像的例子。这个是用C#的System.Random类生成的随机数填充的位图。这个是用php的rand函数生成的随机数填充的位图那么，一目了然。 PHP7下可以直接使用 random函数， 但是PHP5以上没有random函数怎么办呢？ 看看这个吧： https://github.com/paragonie/random_compat/","tags":[{"name":"PHP","slug":"PHP","permalink":"//www.zuohuadong/tags/PHP/"},{"name":"web","slug":"web","permalink":"//www.zuohuadong/tags/web/"},{"name":"随机算法","slug":"随机算法","permalink":"//www.zuohuadong/tags/随机算法/"},{"name":"随机数","slug":"随机数","permalink":"//www.zuohuadong/tags/随机数/"}]},{"title":"XX币/“刷单”/“众筹”Mcclub 为什么是资金盘的骗局？","date":"2016-10-14T15:05:43.000Z","path":"2016/10/14/mfcculb/","text":"还是老样子，请明确两点： 1.不是赚钱的事情就代表它是对的，因为骗人，抢劫，贩毒一样是可以赚钱的。 2.请不要用“如果它是违法的，为什么没被抓”等此类语句，我们今天社会上的违法行为依旧存在，随着网络技术的发展，这种违法行为的发现，取证，彻查也变得越来越难，只能说存在漏网之鱼。 ———–如果您不能理解以上话，那就不用继续看下去了———– 首先从虚拟货币说起，比特币、约克币、瑞波币、莱特币&nbsp;目前占了全球94%以上的虚拟货币市场，如果你玩的不是这四种，那么基本可以直接放弃了。 —————–为了保证大家能听懂，我尽量用自己语言组织，所以不太标准——— 这类虚假货币跟类比特币类最大的不同，是它不需要挖矿，甚至也没有自己币种的名称，直接以人民币标示。 这类的大致归为资金盘，特点是这样： 举个例子： 例一： A虚拟账户里有100币，手里现金是0， B账户里0币，现金100元。 A选择提现100，这时候B把100元现金转给A，得到奖励105币。 此时A 0币，100元现金。 B 105币，0元现金。 但是B可以重复A的过程，继续提现，从而把风险转嫁给C。 可以看出，整个过程都是毫不产生价值的，但是感觉钱在增多。&nbsp;这个时候如果没有C来接B的盘，那么这币就完全砸在B手里了。因为总有一天，提现的人会远远多于接盘的人。 例二： A有100币，可以提现，但是收10%手续费，B想入局，但是只能买币，所以A把币转给B，B把现金给A。然后就是发展下线有提成，各种花样都有。 其实现在一般骗局都至少混合了庞氏骗局，资金池，传销其中的一种或者两种。 拿Mfcclub来说，声称什么来自马来西亚，号称多么牛逼的公司，确在国内连个办事处都没有，连个什么政府审批文件都办不下来。 在马来西亚的目的很简单，这种玩意如果服务器敢放国内，分分钟就被查了。 然后拿一些毫不相关的新闻来给自己贴金，丹麦无现金化跟你毛线关系，数字货币跟你毛线关系，你咋不说印尼海啸跟你有关呢，你说老天爷发怒了，要惩罚这些不用mfcclub的人呢？ 请相信钱不会凭空产生，也不要引诱更多无辜的人参与到这场游戏，因为很有可能他们就是最后接盘的人。如果真的存在这种游戏，那我们12亿人早就靠这种游戏国富民强了。 一如既往地：没事多看看知乎。","tags":[{"name":"DK币","slug":"DK币","permalink":"//www.zuohuadong/tags/DK币/"},{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"刷单","slug":"刷单","permalink":"//www.zuohuadong/tags/刷单/"},{"name":"众筹","slug":"众筹","permalink":"//www.zuohuadong/tags/众筹/"},{"name":"资金盘","slug":"资金盘","permalink":"//www.zuohuadong/tags/资金盘/"},{"name":"经济","slug":"经济","permalink":"//www.zuohuadong/tags/经济/"}]},{"title":"XX虚拟币,Mfcclub为什么是庞氏骗局的说明","date":"2016-10-13T15:52:43.000Z","path":"2016/10/13/dkb/","text":"说这个事情之前，请明确两点： 1.不是赚钱的事情就代表它是对的，因为骗人，抢劫，贩毒一样是可以赚钱的。 2.请不要用“如果它是违法的，为什么没被抓”等此类语句，我们今天社会上的违法行为依旧存在，随着网络技术的发展，这种违法行为的发现，取证，彻查也变得越来越难，只能说存在漏网之鱼。 ———–如果您不能理解以上话，那就不用继续看下去了———– 首先从虚拟货币说起，比特币、约克币、瑞波币、莱特币&nbsp;目前占了全球94%以上的虚拟货币市场，如果你玩的不是这四种，那么基本可以直接放弃了。 本着公平，中立的原则，我将介绍它和货币，常见的虚拟货币区别，以及为什么是骗局。如果您对货币没兴趣，请直接拉到最底部。 —————–为了保证大家能听懂，我尽量用自己语言组织，所以不太标准———– 货币为什么有价值？ 为了搞清虚拟货币为什么会有价格（这里说的不是价值），咱们从货币说起，货币最初只是为了改变大家以物易物的方式，通过一个大家都认可的东西做为货币，由于全球黄金总量是基本恒定的，而开采黄金需要成本，这是真实的工人去淘金，所以会有人工成本，而大家本身对黄金的需求，抬高了黄金的价格，但是一般不会低于人工成本，所以国际货币组织规定是以黄金衡量。 纸币为什么有价值？ 由于黄金/白银&nbsp;都不方便携带，作为国家又有一些其他需求，所以强制规定了本国的纸币作为货币，最早纸币是跟黄金挂钩的，后来取消了，所以目前货币大多是由政府公信力担保，当然如果政府大量发行货币，会导致货币贬值，造成国内经济混乱，大家以后会用其他的货币交易，所以也是得不偿失。 虚拟货币的价格哪里来？ 第一种是Q币这样的，以公司公信力为保障的，这里先不做细谈。 第二种是比特币这样，比特币是一个设计相当巧妙的虚拟货币，主要是以下三点： 1.因为它总量恒定（这点很像黄金）， 2.不受任何个人或者组织的控制（不存在无限增发货币，或者是突然跑路） 3.完全匿名（适合做一些非法交易） 4.开采需要耗费显卡资源，这些实际的成本就是电费。 所以总结起来就是，因为它不受人为控制，而且开采需要消费真实的电费，并且由于匿名，使用范围广泛，所以大家对它存在一个心理预期。 举个不恰当的例子，冥币，在现实世界可能一文不值，但是如果存在另一个世界，可能真的就是他们那里的货币了。所以虚拟货币根源在于人们的心理预期，当人们没有这个心理预期，它就会一文不值，所以是因为有人玩，你才卖得出去，交易得出去。 开头所说的以上四种货币，均符合比特币的这些特点，所以虽然存在风险，但是也是可以玩玩的，但如果不是特殊原因，也并不建议。 第三种是类似U币，DK币这样的完全骗局类型的。 U币，DK币为什么是骗局？ 宣传方式： 任何正规的虚拟币，都没有以赚钱为目的的宣传，都只是方便大家交易使用，或者以对抗政府增发货币为目的。 是否具有价值： 资产是不可能凭空产生的，要么耗费了一定真实的资源（比如电力），要么就是你凭借着大家的心理预期转手赚到的，而对于股市来说，公司可以不断产生价值，要是公司不产生价值，那股票一定会跌。 以DK币来说，租用所谓的云矿机，你真的亲眼见过这个实体的机器？它在消耗什么？ github开源代码： 自己去下载DK币的源代码，能在自己电脑上跑么？不能。&nbsp;只能在掌控人的服务器上跑，真正服务器上有没有这个代码，谁又去验证，反正钱就是一个数字而已。 说白了，自己随便从比特币复制点代码，就算可以运行，放在github上开源骗骗人，至于真正服务器上跑的是什么，你根本看不到。 腾讯、百度、谷歌都有开源的东西，倒是复制一个腾讯出来啊？ 区块链技术： 这个不做展开描述，举个例子，比特币的挖矿用户，是需要安装比特币软件来进行挖矿的，要想破解比特币，你必须掌握这些一半以上的电脑，而这个数量是以百万计的，所以几乎是不可能的任务。而DK币，所有矿机在“云端”，那即使它是真的，控制云端的人也可以轻易篡改数据。 央视报道： 全是断章取义，这也是央视报道：《虚拟货币：只进不出的骗局》http://news.cntv.cn/2015/11/28/VIDE1448667363846704.shtml &nbsp; 随便从央视截个图就能攀上亲戚的，也是醉了。 所以这些骗子币的最主要问题是，可以被完全操控，想让你有多少钱，就有多少钱。 你肯定还有疑问 为什么有人会赚钱？ 因为只要钱不提出来，永远是数字，让前面的人赚了钱，可以骗更多后面的人，典型旁氏骗局。只要有不断会员加入，就不会亏空。所以各种币都会有限制：3个月以后可以提现，新入会员必须买老会员的币，提现需要高额手续费。目的就是鼓动发展会员，维持不崩盘。 说白了这种东西，网上买个程序，谁都可以做。 为什么都宣称是来自国外？ 也很简单，这种违法的东西，在国内根本做不了备案。 怎么证明这点 不论保险也好，基金也好，对于一些可以盈利的东西，比如股市、贷款、高息存款等，基金经理都会去尽量选择低风险高回报，如果DK币这么牛逼，你一年都可以翻几番了，那这些基金经理为什么不入？&nbsp;你所看到的余额宝，还是3%的年回报率。 你是觉得那些基金经理一年上百万年薪，是个傻逼么？ 另外，被我们回绝，但是想找我们开发此类软件的不在少数，需求里还有写明后台要留作弊接口的，具体怎么个运作流程，你真玩的过那些人么？ 最后奉劝大家一句，没事多看看知乎。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"DK币","slug":"DK币","permalink":"//www.zuohuadong/tags/DK币/"},{"name":"虚拟货币","slug":"虚拟货币","permalink":"//www.zuohuadong/tags/虚拟货币/"},{"name":"旁氏骗局","slug":"旁氏骗局","permalink":"//www.zuohuadong/tags/旁氏骗局/"}]},{"title":"QQ/微信为什么没支付宝安全？","date":"2016-09-11T08:27:28.000Z","path":"2016/09/11/wechat-qq-alipay-safe/","text":"使用频率 这点不用说，也明白，一般来说微信/QQ 这种社交产品的登录/使用频率会远远高于支付宝这类应用，古语有云“言多必失”，使用次数和频率的增多，也造成了更容易被盗的现象。 使用场景 一般来说，在网吧等一些明显不靠谱的网站一般人绝对不会或者不敢使用支付宝，但QQ造成心理感受到的损失相对来说要小很多。 登录方式 最早来说，QQ只要通过账号密码就能登录，手机短信也贵，而且电脑普及度也并不是那么高，所以绑定设备这个方法不可行，那会智能机还没出呢，另外，那时候电脑各种流行病毒木马，甚至假QQ都有，一不小心就输入密码进去。而支付宝当时只有网页版，需要安装数字证书等等（毕竟常用来支付的电脑就那几个），但是这种方法显然不能用在QQ上，你去网吧也安装个证书？完事还得小心翼翼卸载掉，显然不能这么干。 现在来说，智能机普及了，验证方式也多种多样，尤其是可以感觉到微信的安全（毕竟是绑定手机）要比QQ安全好出很多。 产品属性 两者产品属性而言，QQ/微信毕竟是要在安全和方便使用之间做个权衡，这就肯定不可能弄个U盾放银行保险柜，需要的时候再取出来登录，技术上肯定不是问题，但使用方便上，就太神经病了。也总不至于发个聊天消息，验证手机短信、输入聊天密码吧。 支付宝也有学习微信方面的，比如微信支付一开始的六位数字支付密码，后来支付宝也这么干了，所以都是从安全和便捷中做个权衡。 而支付宝就可以通过短信验证，各种方法去限制，来保证用户财产安全。 安全方向 QQ/微信&nbsp;更倾向于诈骗的提醒，这是产品不同所导致的方向不同。 支付宝则倾向于账户安全，还弄了保险，就算被盗了，它还可以赔钱给你啊，让你觉得支付宝还是很靠谱。 用户心理 另外来说，还有一点更根本的原因，QQ只要登录上去，就认定是被盗了，支付宝，登录上去，你还得把钱转出来，用户才觉得被盗了。况且还有很多用户的支付宝里面根本不放钱，所以这对比来说，也是不公平的。 使用人群这也是特别重要的一点，比如，现在年轻人好多父母，一定会使用微信，但不一定使用支付宝。使用支付宝的用户一般来说，也比使用微信的用户更懂互联网。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"微信","slug":"微信","permalink":"//www.zuohuadong/tags/微信/"},{"name":"qq","slug":"qq","permalink":"//www.zuohuadong/tags/qq/"},{"name":"wechat","slug":"wechat","permalink":"//www.zuohuadong/tags/wechat/"},{"name":"alipay","slug":"alipay","permalink":"//www.zuohuadong/tags/alipay/"},{"name":"支付宝","slug":"支付宝","permalink":"//www.zuohuadong/tags/支付宝/"},{"name":"安全","slug":"安全","permalink":"//www.zuohuadong/tags/安全/"}]},{"title":"为什么微信一直没有电脑客户端","date":"2016-09-11T08:27:28.000Z","path":"2016/09/11/wechat-pc/","text":"首先说明，这里的客户端是真正意义上拥有几乎微信全功能，而且可以离开手机APP，独立使用的客户端。 没必要与QQ交火 不得不说微信一旦推出这样的客户端，那么就必然出现，在PC端增加用户体验，功能要无限与QQ接近，这样无意会增加产品开发难度，同时这些功能要不要加进手机版里？那又会无限臃肿。而且已经有QQ了，为什么还要再有一个QQ？ 安全性问题 如果推出电脑版，不再需要微信扫一扫，那安全性就得重新考虑，这一来又得增加各种功能。而这样的带来的额外价值并没有多少。1 产品定位 微信真正专注于的，在于移动端，客户群体来说，也没必要用微信既实现日常交流，又实现办公相关的功能，这样更容易使得很多人办公和生活无法分离。会造成新的问题和麻烦。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"微信","slug":"微信","permalink":"//www.zuohuadong/tags/微信/"},{"name":"微信电脑端","slug":"微信电脑端","permalink":"//www.zuohuadong/tags/微信电脑端/"}]},{"title":"再谈解放号与威客","date":"2016-07-27T10:13:57.000Z","path":"2016/07/27/jiefanghaoweike2/","text":"发现自己很久没有更新博客了，最近一直比较忙，但也确实有不少想说的话。 基本上眼睁睁地看着天篷网做废了，解放号一直定错位，好多好的东西一直没执行下去，这也算是解放号的一个悲剧吧。 解放号的问题 问题一：产品定位不明确 那先说说解放号的问题吧，解放号定位一直是大型项目开发，最近动静不可谓不大，开发协作功能之全，代码托管和质量管理等等流程之专业，真的差不多够把一个大型项目“完整”托管到解放号了，这里的“完整”其实也意味着包括了整个项目管理。 但是，然并卵，既然是大型开发，不可能没有自己完整的一套体系，如果解放号功能不够完整，那我为什么要用它，话说回来，如果解放号功能够完整，我是不是还是要考虑我的迁移成本，我的协作成本，那我还是不会用这玩意。另外，既然这么大型的项目，我不太可能不进行线下交易，不太可能把代码托管到解放号，因为不论甲方乙方都会担心代码泄露。那对于中小团队及个人开发者来说，用这玩意好麻烦啊，操作好繁琐啊。 那，我只能说本来分析问题的思路是对的，解决双方信任问题，用专业的工具管理，后期好评估责任，这也确实是痛点，但是解决问题的方式完全不对。对于中小团队，应该考虑的是简化流程，方便双方使用，把流程简单和规范化，然后引导双方使用，这样才能有利于双方，而不是把东西全部照搬，然并卵的。对于大型项目的开发，解决的问题应该是同步乙方和甲方的数据到平台上，比如定期把项目进度贴上来，作为阶段性证明，把项目规划贴上来，告诉甲方什么时候该验收什么，差不多是什么标准。而不是去改变用户习惯。 问题二：想法不错，执行太差 举个例子，解放号有个在线合同，是坑了我很多次，不论哪方违约，都没有强制执行的可能，也没有从下次项目中扣款的可能，更没有提示风险或者直接拉黑的。那这个在线合同更多只是名义上的。如果是小项目或者项目特别紧急的，也很难去完全走一份线下合同。所以一份交易保障，或者是发包方接包方的评星，可能远比这个更有用。 问题三：优质开发者资源并没有被良好利用 一直觉得解放号有着优质的开发者资源，可是在网站上并没有突出体现出来，并不能直观地看到哪个开发者就一定比哪个好。只能是通过官方客服来对接资源。这种一方面开发者很难有良性竞争，另外一方面&nbsp;导致解放号只能投入更多人力来解决这个问题。 问题四：工具没解决用户痛点 就举个项目代码质量评估，且不说然并卵的问题，用户实际操作上也并不会用，你弄个discuz&nbsp; phpwind&nbsp; ecshop dedecms …的判断都比那好很多。最近有了解到一个云沃克的威客平台，在用户痛点上把握得也非常到位。收取项目10%费用，帮助做项目前期需求分析，评估开发工期，平台上的单子利润不是特别大，但也没有特别坑的，一些技术主导型的团队就十分适合，完全不用担心跟客户沟通问题。有时候一个大的项目10W，被分成小项目可能就3-5W，同时他们也解决了项目的风险，还聚集了一堆有能力的开发者，这才是良性循环。 但是，解放号上，我根本难以看到这种用户痛点。 解放号应该怎么做 第一：&nbsp;做好定位，简化非必要流程，增加必要流程 如果大型企业并不怎么需要这些的话，那针对中小团队和那些在大型企业兼职的开发者重新思考解放号的立场。 这些人其实多多少少是有使用工具的习惯的，尤其是那些在大型企业工作的人。但对于这些小项目如何让它方便简单地使用。 发包，推荐用户说明哪些是必要内容，在用户不懂的情况下，可以找客服沟通，也可以使用推荐的模板。 审核，拒绝一些明显离谱的需求，这类需求是很容易伤害开发者的。 需求，比如需求界定，最后通过文档还是什么，推荐开发者使用什么样的工具什么样的形式来确定，有什么样的推荐。当然，如果是审核相当优质的资源，可以做重点推荐，以及官方做需求分析。 然后开发过程中，整合一些比较好的开源项目推荐给开发者，这样能节省时间，也能降低开发成本。 然后评审，比如使用了dedecms 开发，原则上没有版权，但国内都这样用，代码质量只能说一般，比如使用了ThinkPHP5.0框架，代码简洁，告诉用户经过评审代码质量很好。同时也能确定出开发者的能力。 验收，交付等等，以及如果违约，该怎么处理，关闭接包方账号还是提示有风险等等，或者从下一次项目中扣款补偿。 像什么会议沟通什么的，QQ在线沟通可能更方便，还能传文件，上次遇到跟客服聊天，传图片的时候都出问题了。留痕确实要有，比如通过需求文档，通过git代码托管（如果不熟悉，可以直接上传代码包），但是交流的习惯很难改变。 中期验收确定，以及文档交付，包括管理账号、说明文档、服务器账号密码等等。主要是得流程化，一步步告诉双方怎么走。 第二：&nbsp;做好开发者资源 解放号内部CRM的接包方信息很全，不如把一部分资源放出来，建立开发者完整档案，做国内优质的接包方平台，吸引国内的发包方甚至是其他平台的二包。 建立完整的诚信和案例档案，每个案例都严格过审。 第三：建立高质量外包开发 其中包括对接国外的一些开发资源，尤其是印度，当然也要解决沟通问题。 发包方输入需求时，提示可以使用XX进行二次开发，节约成本，用户能浏览大致功能。 接包方也能看到一些程序和插件的提示，建议使用，增加开发速度。 同时所有开发会和网上一些现成的进行代码比对，确保质量。 第四：建立开发者社区共享代码成果 官方最好主导一些开发，比如CMS主要推荐 doccms 次要推荐dedecms，论坛主要推荐：Discuz。&nbsp;然后大家有开发功能或者插件、模板、甚至是解决某个问题&nbsp;的可以放在官方商店，其他开发者使用需要付费或者免费。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"解放号","slug":"解放号","permalink":"//www.zuohuadong/tags/解放号/"},{"name":"威客","slug":"威客","permalink":"//www.zuohuadong/tags/威客/"}]},{"title":"最近关于人人网和产品相关面试的思考","date":"2016-05-25T17:38:29.000Z","path":"2016/05/26/chanpinmianshi/","text":"最近在招产品经理和产品助理，面试题是谈下对人人网发展的思考。也确实发现在西安，产品经理和产品助理实在是供大于求，而真正合适的却很难找，大多只是有自己想法。一些人甚至说出了产品该全面发展的话，普遍用对错作为事实的唯一衡量标准。 如何思考问题？ 有句话叫“小孩才思考对错，大人只权衡利弊”，所以产品一定是放在当时时代，为什么这么做？因为什么样的矛盾最终选择了这么做？甚至在当时情况下，这是不得已而为之的。 产品经理应不应该懂技术？初步的技术你是要懂的，哪怕不深入，你的想法最终要靠技术实现的，那你也是要跟技术去沟通的，如果你不懂技术，说出来天马行空的话，技术是想抽你的。很多产品经理想着：专业的事交给专业的人去做。举个例子，phpwind9.0发布测试版的时候，用户中心对接多个论坛，中间的设置相当麻烦。从技术角度来看，这些东西缺一不可。但如果你是一个懂点技术的产品，就能看出来，有其中一半的步骤是不需要的，这样提升了用户体验，也没降低安全性。我后来跟他们产品经理提，然后他们跟技术确认完之后，是按照我提的方案来的。 产品经理该不该懂运营？产品首先要明确，是以运营为主导（一般就是活动居多），还是以产品为主导（产品特性吸引用户）。作为产品经理，是肯定要考虑到运营的事情，多做沟通，不然真是给运营埋坑。 产品经理需要干什么？除了跟技术交涉，通过运营数据决定产品方向，分析和调查用户真实需求，画出线框图或高保真原型图以外，还要能辨别用户需求里的坑，找出没有完善的逻辑部分，指出更好的产品方案以及初步的规划。如果兼带项目管理者，那还要随时把控项目进度，协调各方资源，随时准备应急措施。 简单说下人人网的发展？个人观点：人人网最初叫做校内网，号称占领了国内实名制社交，&nbsp;但他必然面临的一个问题就是，&nbsp;每年都有毕业生，每年都有新生，这是一个不断投入&nbsp;却没有增长的市场，扩招和计划生育到底哪个占大头呢？从当时PC游戏产业看（当时手游并没有兴起），整个玩家人数在下滑。基本上可以预估到，人人如果保持当前状态，校园市场也会不断萎缩。但是转念一想，走出校园的很多是白领，所以在当时情况下，走出校园，尤其是切白领市场，算是人人比较好的方向。 但是，没有细分白领市场，很多人离开校园后看到人人上还是校园的信息，怀念，但又没办法再融入。所以很多人还是默默离开，当然也有毕业N多年，再通过人人去找老同学的，大多都是问下手机或者微信号，人人并没有那种强社交的属性。走出校园的失利，以及再次看到校园市场的潜力，的确是该重回校园，公共主页确实是个好东西，这其中也促生了很多大V，真是各种转发满天飞，问题也依然存在，就是大量的信息重复充斥着动态，几周前看过的段子，今天又看到了，大量的转发使得看不到校园动态了。同时也没很好的办法去鼓励原创，所以给公共主页降低权重（在动态的第三条折叠显示，类似现在新浪微博的广告），同时也使得大量的大V叛逃人人，转向微信和微博。 进入校园的产品:一是校园广场，直接竞争对手是贴吧，但是校园广场一直体验不好，而且不同于公共主页的创建，校园广场是任命的形式（应该是考虑到同一学校多个人申请的问题），大家觉得公共主页是创建的，是自己的，校园广场是人人的，这么一个感觉，所以很多管理员也不是很尽责。【中间收购糯米和56 以及校园大使事件不在此累述】校园广场最大的问题还在于入口问题，这个我最早有抛出来，最开始校园广场作为一个子菜单出现，后来改成和动态并列在第一屏（需要切换），但却一直没能敢代替动态成为第一入口。因为它叫人人，确实不敢做这样大的尝试，改变产品属性，我觉得这可能是原因吧。 二是社团人，事实证明这本是应该由运营主导的产品，没能很好地切入线下，解决实际问题，也不再累述。同时人人也有&nbsp;哔哔，么么答这两款仿的程序，匿名社交满足好奇心，但违反了人社交基本规律，由生到熟的过程。么么答和所有这类软件一样（比如后来的足迹等等），都无法持续火起来。况且，此时还有外部原因，微信朋友圈（社交）引走了大部分的流量，微博（媒体）也崛起了一批又一批的大V，几乎是腹背受敌，而人人的体验依旧很差（请搜索人人小秘书），广告能够占头条动态的位置就很能说明这一点，各子部门想着快速表现和快速推广新产品，就往往是以牺牲用户体验为代价的，当然人人内部也急需一个新的产品替代。再后来利用学生资源做分期做金融，确实也是无奈之举，以及后来取消实名制，图片美化与贴图的尝试，至此，人人不再是那个人人。 以上仅代表我个人观点，我相信任何人都会有自己不同见解，不代表对与错，对于大公司来说，可能从来不缺想法，但为什么这样做，又是怎么一步步走向成功或者失败，这是一个产品经理该明白的。用自己观点合理说明即可。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"面试","slug":"面试","permalink":"//www.zuohuadong/tags/面试/"},{"name":"人人网","slug":"人人网","permalink":"//www.zuohuadong/tags/人人网/"}]},{"title":"解放号与威客的一些思考","date":"2016-01-16T09:31:07.000Z","path":"2016/01/16/jiefanghaoweike/","text":"传统商品售卖，顾客往往是出于对商品品牌、对售卖人的信任，比如名牌和微商就是这两个极端的代表。而威客是以技术服务为商品的，技术服务这种的具有一定的时间性和不可见性，即双方都不知道在服务期限内会不会出现意外，也不知道对方是按照什么标准来做什么标准来验收的。所以，威客这种服务，信任危机是与生俱来的， 而平台的出现，一定程度上将双方的信任改变为对平台的信任，之前号称国内第一威客平台的某西游网，初期确实带动了一部分威客致富，但随着威客的增多，平台知名度的增强，一些通过平台漏洞来赚钱的人也越来越多，于是需求方坑服务方，自己选自己中标。服务方坑需求方，一堆不相关垃圾作品奉上，选我中标后才给你开始服务。而平台固定收取佣金的方式，导致平台本身也没有动力去制止这种行为。于是，再一次的信任危机爆发。 最近，有一句话逐渐流行起来，叫“专业的人做专业的事”。原本这句话是讲公司内部分工问题，逐渐延伸为外包。请记住，最初这句话说的是公司内部的分工问题，但是一旦延伸到外包，外包团队和你的利益点和需求点都是不一样的，他们是他们公司的利益，所以这句话延伸的前提是这个外包团队可信。于是，大家开始把非核心业务外包，我们之前接触到的一个客户连续被三个外包团队骗了，最后给他交付的东西，是一套现成的源码，根本不是客户的需求。所以很多客户要求本地，需要实地考察，一定程度上也反应了外包产业的混乱。所以逐渐出现两个极端，小的外包团队价格越拼越低，大的外包团队价格越拼越高，反而是有质量的产品难以出现，整个外包产业都很浮躁，简单，快速解决问题，就跟游戏打怪升级一样升到100级再说，装备跟不上也不管了。 这里有必要说下收取交易佣金的问题，既然威客的服务也是属于一种商品的性质，那么，就有理由参考淘宝、天猫、京东这些网站，不论是国外的ebay还是国内的电商网站，交易佣金是不直接收取的，威客这种高服务性质的，如果存在佣金，很多人通过平台交易一次后，就逐渐专为线下交易，或者转为其他不收取服务费平台的交易，服务是有一定时间的，双方通过这段时间相互熟悉，理解，信任，还是很有可能的，对于平台的感情不一定大于人情，这是很难解决的。而免费的则通过店铺VIP、引流方式收取服务商的费用，但是这种，你也很难保证威客的质量，换句话来说，威客这种平台天生存在两种人，一种低价解决需求就行的人，对应的手头有一堆代码，破解的，没授权的，之前做的，能分分钟解决问题，但可能漏洞百出，但是需求方就是需要这种的，我淘宝买套代码才500，你改改东西就要收我5000，这是低端需求方没办法接受的。另外一种姑且称为高端需求方，他们意思也很明确，我给你这么多钱，你好歹给我做好点吧，但是用旧程序做的，用侵权程序做的，也比比皆是，作为需求方也很难辨别，往往当了个冤大头。有些有点条件的需求方，朋友懂点技术，就开始胡乱要求，比如你为什么不拿C++这种高效率的程序做网站呢，你跟他对喷没有好处，需求方请的人肯定是他信任的人，你按照他的方式做也是坑爹，只能慢慢理论。所以从趋势来看，整体应该是会逐渐偏向于免佣金的形式，但是会收取服务方的服务费，当然，你平台流量肯定是得有的，不然真没人掏服务费，而且怎么避免那些没有能力，但有钱的团队不会破坏这一平衡呢，这需要一个长期沉淀结果，而且团队这种的也是会变的，万一哪一天核心人员都走了，可真就从高质量团队变成低质量的团队了，这种不可控因素也太多。这种不如直接从人身上做把控，一些团队由哪些高质量的人组成，当然面临的问题就是有些接私活的怎么办，隐私怎么保证的问题。从整个中低的外包市场来看，往往做的质量比较高的是一些大企业，尤其是是BAT这样企业的员工，做的东西质量和逻辑上都比较不错，相对来说价格也算合理，但是有时间问题，比如近期公司突然上线一个项目，这就有可能导致外包的活要延期。另外，由于本身资金来源不是外包，这个难以严格把控，没有个制约的条件。 整理下总体的需求，低端的不谈，基本上淘宝就能解决这问题，也确实很多通过淘宝交易。谈所谓高端些的需求方，给钱，把事做漂亮，但是又没办法验证代码的质量，最基本的也就是通过使用功能看看有没有问题，看看界面做的怎么样之类的，随时催问下进度。当然也不乏一些有技术要求的客户，比如大公司项目的某一部分外包或者是已经做了一部分的项目二包，这种的是有明确技术要求的。长远来看，外包和自己构建团队开发的区别主要在于外包注重快速简单的开发，而自己团队往往考虑开发周期的同时也考虑项目的可维护性，这点几乎是难以避免的。我们对于这种方式有个解决办法是先找一个可靠的维护团队，再让可靠的维护团队找一个自己不认识的开发团队，通过维护团队来倒逼开发团队不可能做一些难以维护的事情。当然，对于平台来说，怎么做，或者怎么实现就很难了。另外一方面，从服务方需求来谈，服务方往往需要的是高质量的项目，这些包括，需求确定，资金充足，便于沟通，相互信任等，可以说有一半的问题都存在于需求沟通上，这个我暂时没有看到有一个威客平台去提供比较严格的需求模板来帮助用户整理需求的，都是给一些无关痛痒的，甚至是一般用户不理解的东西。然后签订好协议之后，就是开发阶段了，一般情况是需要制定流程，比如网站从原型图到UI 再到web前端&nbsp;再到后端部分，是需要一套较为规范的流程以及相应的审核标准。便于沟通这个来说，普遍用户习惯还是在于QQ和电话，比如传文件、屏幕演示、语音，当然缺点也在于举证麻烦，所以很多网站为了解决双方沟通问题，派客服去跟进去解决双方矛盾，一定程度上能缓解这个问题，带来的好处也是双方对平台的依赖性提高，坏处也显而易见，就是对于平台，这样人工成本太高。 解放号尝试解决的问题是利用合同和资金托管来解决需求方诚信的问题，用git提交物和代码质量检验来解决服务方诚信问题，固定佣金提成，不设VIP，也没有各种加急什么的。可以说，解决的是基础需求层次，但并未做更深一步的延伸。而猪八戒网又在高端领域做了天蓬网，比如设计类的规定哪一级别的设计师，每页不得低于多少元，开发类对项目时间、人力、价格三维做了对比参考，交易不收取佣金，对服务商严格审核，也算是进了一步，但老问题依旧，取证困难的问题依然没有得到解决。当然威客平台这种方式有个问题在于当然前提是网站有大量的客户流量，而且需要适当平衡双方，需求方太多，没有人接单也不行，服务方太多，抢一个单做，导致恶性竞争也不行。一般任务来说，有80%以上的都是常用需求或者类似需求，比如网站中&nbsp;微信平台基本功能&nbsp;关键词回复、自定义回复、优惠券、微商城、多级分销、各种促销推销活动，企业CMS站，商城、论坛、问答系统&nbsp;这些占大多数，能对这样的做一个统一的定价参考范围，也有利于需求方了解大致价格发包，服务方筛选合适的单子。 总的来说，解放号有着大量优质的接包方资源，但需求来说较少，也处于供需不平衡的阶段，很多服务商依旧把解放号作为第二选择，简单放心地拿到外包，但总量不太多。。","tags":[{"name":"产品","slug":"产品","permalink":"//www.zuohuadong/tags/产品/"},{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"解放号","slug":"解放号","permalink":"//www.zuohuadong/tags/解放号/"},{"name":"一品威客","slug":"一品威客","permalink":"//www.zuohuadong/tags/一品威客/"},{"name":"猪八戒","slug":"猪八戒","permalink":"//www.zuohuadong/tags/猪八戒/"},{"name":"天蓬网","slug":"天蓬网","permalink":"//www.zuohuadong/tags/天蓬网/"},{"name":"威客","slug":"威客","permalink":"//www.zuohuadong/tags/威客/"}]},{"title":"请不要吃那些狗狗了好么","date":"2015-12-23T06:14:51.000Z","path":"2015/12/23/dogs/","text":"狗是人类忠实的朋友，你看那些牛、马、鸡都是傻的，牛只会勤勤恳恳地耕地，就知道抢驴的饭碗，简直是可恶。而马也就被骑骑，没有马就不会有骑兵的厮杀了，这马害死了多少人？最可恶的就是那鸡，天蒙蒙亮就打鸣，就不能让人多睡会啊？你看看狗，狗可是会看门，任劳任怨，日日夜夜守着家，容易么？ 狗既然不是区别于其他动物，那老实说，牛，羊，鸡也挺可怜的，我们讨厌的那些害虫也是为了生存，他们也挺可怜的，其实整个动物界都挺可怜的，所以我们也看到了很多素食主义者，不过话说植物也是有生命的，因为他们都是生物，那我们最好是也不要吃植物了，既然扩大到植物，那微生物是不是也很可怜，我们不要呼吸了，不要治病了？ 我不知道这种思想是如何入侵我们价值观的？我们小时候已经是对各种各样的事物充满了偏见，蜜蜂是勤劳的，蟑螂是要消灭的，牛是忠厚老实的，狐狸是狡猾的。比如牛，它本身就是要在草原里生长，我们把它绑起来，命令他们耕地，动不动就杀掉，吃牛肉，拿牛皮做各种鞋子皮包，“你看，牛是人类的好朋友啊，生前勤勤恳恳，任劳任怨，死后又将自己奉献给人类。”牛是这么想的么？ 我们对待动物的情感总是以个人利益来区分，我们将对自己有利的统统称为朋友，而将对自己不利的全部视为敌人。 而作为食物链的一环，这些动物都有它存在的合理性和必要性。 如果将爱不爱狗强行作为一个人有没有爱心，这跟道德绑架其实也没有区别，你那么有钱，不捐款就是没有爱心。 况且很多爱狗人士也是有选择地爱，比如只爱可爱的，听话的狗，土狗不爱，因为土狗不可爱也不干净，藏獒也是，因为身上气味很重，太凶。有人会反驳我说，有人养藏獒，养土狗，但很多是看门护院，你微博上、QQ上见大家因为喜爱转发的有多少？何况很多爱狗人士往往对狗造成了伤害。比如为了救自己的宝贝金毛犬，买了一只土狗活活抽血致死。 这些人，他们知道自己不吃猪肉是不行的，而且猪大多又丑又脏，不像狗，时不时可以摸两下。 一个人拿着这种自私的情感，去衡量别人是否有爱心，这种人的心胸是狭隘的。甚至利用此，站在道德制高点去指责别人，这种行为是荒谬的。 当然不是提倡大家吃自己宠物，人非草木，孰能无情，但也对其他动物也有个公平的对待，也不要剥夺别人的权利。真正该打击的，是那些偷宠物，贩卖别人宠物的人。 佛教不杀生，甚至是对苍蝇、文字、老鼠也是如此，如果你爱护生物，也请对动物、植物、微生物也一同对待。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"爱狗","slug":"爱狗","permalink":"//www.zuohuadong/tags/爱狗/"},{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"}]},{"title":"冲击实体行业，罪在电商？是该发展还是创造就业机会","date":"2015-12-23T05:39:15.000Z","path":"2015/12/23/hualianwang-dianshang/","text":"图书、服装、家电等产品的实体店受到（电商）冲击最大，部分实体店经营困难甚至出现了关闭潮。部分传统的百货商场也受到较大冲击，经营景气度持续下降，这对相关群体就业带来较大影响。 &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;——&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;发改委 发改委的逻辑一向比较跳跃，比如涨油价的时候相当干脆利落，轮到油价下跌的时候就支支吾吾了，总是以各种理由搪塞，比如前不久声称“雾霾严重，油价下跌汽车跑得更欢，这样不利于环保”就不降价了。 “尽管网上商品零售、快递等新兴业态创造了部分新的就业岗位，但也必须注意到网店对实体店带来的冲击和显著的替代效应。” 也就是说电商高速发展，其实是对实体造成了冲击，这是一种替代效应。 “图书、服装、家电等产品的实体店受到（电商）冲击最大，部分实体店经营困难甚至出现了关闭潮。部分传统的百货商场也受到较大冲击，经营景气度持续下降，这对相关群体就业带来较大影响。”这句话更深层的意思电商制造的就业已经无法弥补它所带来的失业，这种不对等不仅仅是数量，还有地域和年龄上的。京东冲击中关村就是一个很好的例子。 如果仅仅是到这，我觉得发改委是没必要说明最后一段话的，寓意恐怕在于把失业的罪责推给电商，发改委的出发点可能在创造就业上，下一步可能要出台政策抑制电商发展，或者是给各地政府警醒下。 但是我就一直没明白这是什么逻辑？ 举个例子啊，公交车通行之前，满大街都是人力车，大概1-2个人就能创造1个车夫的就业，现在公交车来了，30-50个人&nbsp;无人售票，一个司机就能搞定。现在发改委发话了，公交车冲击了人力车行业，造成了更多人的失业，罪责全在公交车。 换个例子，20世纪属于集装箱的时代，集装箱推动了经济的快速发展，但使得大量装卸货的码头工人失业，这些工人一部分开始了集装箱相关的其他工作，另一部分转入了其他行业。而马克思的生产解放理论也谈了国家发展需要解放生产力。从维稳角度讲，国家有必要创造就业机会，但不应该是通过限制新的技术发展来实现，而应该是帮助人民逐渐过渡到新的产业。 作为发改委，发展和改革目的也并不是仅仅创造就业机会而限制新的模式和技术发展吧。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"网络","slug":"网络","permalink":"//www.zuohuadong/tags/网络/"},{"name":"电商","slug":"电商","permalink":"//www.zuohuadong/tags/电商/"},{"name":"发改委","slug":"发改委","permalink":"//www.zuohuadong/tags/发改委/"}]},{"title":"阿里，放开市场，再谈市场问题市场解决。","date":"2015-11-17T17:26:12.000Z","path":"2015/11/18/ali-shichang/","text":"说实话这个问题很难解释，或者是因为淘宝大，或者是因为马云有影响力。 2015年双十一前夕，京东实名举报阿里逼迫商户二选一，其中真假不做辨别，也不是一两年了，各位可以退回几年前看天猫逼迫商户二选一的聊天记录，这事历来已久。 正常情况下，天猫双十一流量多，商户往往会抛弃京东选择双十一的促销，这样的品牌不在少数。天猫因为有淘宝，支付宝的用户习惯，流量为什么多不再累述，到底好不好，反正假货也不少。 好了，看看阿里奇葩的回应:市场问题市场解决。来来来，把这话给联合国说说:政治问题政治解决。给法律说说，杀人问题杀人解决。然后阿里投资的UC，新浪就开始煽动这事，引导大众指责京东。 阿里，你放开市场，再说市场问题市场解决吧。逼迫商户二选一真不应该是一个大企业应该做的事情。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"阿里巴巴","slug":"阿里巴巴","permalink":"//www.zuohuadong/tags/阿里巴巴/"},{"name":"淘宝","slug":"淘宝","permalink":"//www.zuohuadong/tags/淘宝/"}]},{"title":"淘宝假货多，真的是你太贪么","date":"2015-11-17T17:05:02.000Z","path":"2015/11/18/taobao-jiahuo/","text":"事情起因于淘宝假货事件，事后媒体总结:淘宝不是假货多，是你太贪。 先说说这句话的强盗逻辑，淘宝不是假货多，是你太贪。杀人，怪你太贱。抢劫，怪你太有钱。放火，你不顺眼。最重要一点，你假货是标着真货卖的，明显的欺诈。但如果你真标明假货，消费者还买，那就只好一个愿打一个愿挨了。 我是承认25元买不到劳力士，可是那些卖假货的也不傻啊，专柜价买到假货肯定也是有的，这能怪消费者太贪么？ 之前一做过淘宝多年刷单的朋友，总结了这么一句话:没有假货就没有淘宝。可见淘宝假货有多少，如今，时隔多年，淘宝很多假货也变成了“真货”，不妨各位去搜搜“皮包”，对，很多长得很相似，甚至一样，却只是牌子不一样，而差价竟达到50%。我跟你长得一样，牌子不一样，总不能是假货了吧，这招简直妙绝，不明真相的消费者，真以为他家折扣更低呢。 退一步来讲，淘宝作为一个平台商，无需为假货负全责，但仍有监管责任。我们看到的应该是淘宝的态度和决心，不应该是一句怪消费者太贪的文字游戏。 那有人又问了，这问题你有好的解决办法？有啊，假货问题，正品解决。允许已经核实的正品店铺举报调查，核实后有奖励，并且查封假货店铺。建立店铺的相互举报查证机制，只不过这样淘宝自然会投鼠忌器。","tags":[{"name":"金融","slug":"金融","permalink":"//www.zuohuadong/tags/金融/"},{"name":"淘宝","slug":"淘宝","permalink":"//www.zuohuadong/tags/淘宝/"},{"name":"假货","slug":"假货","permalink":"//www.zuohuadong/tags/假货/"}]},{"title":"为什么中老年人喜欢用这样的QQ表情","date":"2015-08-24T04:25:04.000Z","path":"2015/08/24/zhonglaonianren-biaoqing/","text":"前段时间豆瓣发起了&quot;中老年QQ表情大赏&quot;，网友们贡献了不少类似的表情，&nbsp;这类表情大多采取「主体+文字&nbsp;」的版式，图片主体通常是美女、鲜花、蝴蝶、婴儿、宠物、造型简单的卡通人物等。配色方面偏爱对比强烈，常见渐变发光阴影等效果，突兀生硬的拼接也不少见。&nbsp;&nbsp;对于年轻人来说实在很难欣赏这种审美，&nbsp;但同时，我们喜欢的表情和颜文字也很难获得他们的认同，&nbsp;他们觉得那不通俗易懂，难以理解。&nbsp;这种情况或许可以用「代沟&nbsp;」二字概括了事，但具体是什么原因导致的呢？&nbsp;或者换一种问法，是什么导致了两者间审美品位的巨大差距呢？&nbsp; =========================================== 任何一个产品其实都是先由技术提升，再回归审美提升的。就拿最初iphone来说，屏幕的高分辨率+内容拟物化的设计，让人感觉如此“逼真”，如果最初是高分辨率+扁平化设计，可能很多人会觉得这只是更清晰的诺基亚罢了。等到行业整体技术已经被拉到这种高度之后，回归“审美”，走扁平化趋势，就显得很跟进时代了。（做过设计的很多可能都深有体会，一些客户会觉得立体效果的更具有“技术含量”） 其实现在中老年人玩QQ时代更像我们06-08年那会玩QQ的时候，也只是重复了我们那个时代的审美以及好奇。在文字聊天时代，相对于文字，QQ默认的这些表情已经显得有趣多了。后来，那些像“年画”一样的表情也显得更有技术含量（神马彩虹色，显得比黑白有技术多了），后来的动图表情更是给这种“技术含量”提升了一个档次。如果QQ魔法表情支持手机端的话，我想也会像当时一样火起来。而我们这些80后90后，已经是经历过那个时代了，谁给发个会动的表情也不会引起大家好奇心了，反而是大家开始追求审美了。后来再火起来的就是H5页面了，网页居然可以像放PPT一样动起来，等到大家都习以为常的时候，真的就又是拼“审美”的时候了。所以，中老年表情只是一个技术上升的阶段，还没能停留在审美阶段。","tags":[{"name":"互联网","slug":"互联网","permalink":"//www.zuohuadong/tags/互联网/"},{"name":"随笔","slug":"随笔","permalink":"//www.zuohuadong/tags/随笔/"},{"name":"表情","slug":"表情","permalink":"//www.zuohuadong/tags/表情/"}]}]